{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#####https://community.neo4j.com/t/how-to-install-neo4j-for-python-jupyter-lab/14181/7\n",
    "#####pip install py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "graph = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\"))\n",
    "\n",
    "query = \"MATCH (n) DETACH DELETE n\"\n",
    "graph.run(query).data()\n",
    "query = \"MATCH (n) return n\"\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CREATE (rupert:Person { firstname: 'Rupert', age: 24, city:'London' }), \\\n",
    "                (nargess:Person { firstname: 'Nargess', age: 21 }), \\\n",
    "                (katherine:Person { firstname: 'Katherine', age: 24, city:'London' })\"\n",
    "graph.run(query).data()\n",
    "\n",
    "query = \"CREATE (sailing:Hobby { name: 'Sailing' }), \\\n",
    "                (travelling:Hobby { name: 'Travelling' }), \\\n",
    "                (champagne:Hobby { name: 'Champagne'})\"\n",
    "graph.run(query).data()\n",
    "\n",
    "query = \"MATCH (p:Person {firstname: 'Rupert'}),(o:Person {firstname: 'Nargess' }) MERGE (p)-[r:KNOWS]->(o)\"\n",
    "graph.run(query).data()\n",
    "query = \"MATCH (p:Person {firstname: 'Rupert'}),(o:Person {firstname: 'Katherine' }) MERGE (p)-[r:IS_MARRIED_TO]->(o)\"\n",
    "graph.run(query).data()\n",
    "query = \"MATCH (p:Person {firstname: 'Rupert'}),(o:Hobby {name: 'Champagne' }) MERGE (p)-[r:LIKES]->(o)\"\n",
    "graph.run(query).data()\n",
    "query = \"MATCH (p:Person {firstname: 'Nargess'}),(o:Hobby {name: 'Travelling' }) MERGE (p)-[r:LIKES]->(o)\"\n",
    "graph.run(query).data()\n",
    "query = \"MATCH (p:Person {firstname: 'Katherine'}),(o:Hobby {name: 'Travelling' }) MERGE (p)-[r:LIKES]->(o)\"\n",
    "graph.run(query).data()\n",
    "query = \"MATCH (p:Person {firstname: 'Nargess'}),(o:Hobby {name: 'Sailing' }) MERGE (p)-[r:LIKES]->(o)\"\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n': (_154:Person {age: 24, city: 'London', firstname: 'Rupert'})},\n",
       " {'n': (_155:Person {age: 21, firstname: 'Nargess'})},\n",
       " {'n': (_156:Person {age: 24, city: 'London', firstname: 'Katherine'})},\n",
       " {'n': (_157:Hobby {name: 'Sailing'})},\n",
       " {'n': (_158:Hobby {name: 'Travelling'})},\n",
       " {'n': (_159:Hobby {name: 'Champagne'})}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"MATCH (n) return n\"\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': (_0:Person {age: 24, city: 'London', firstname: 'Rupert'}),\n",
       "  'type(r)': 'LIKES',\n",
       "  'b': (_5:Hobby {name: 'Champagne'})},\n",
       " {'a': (_0:Person {age: 24, city: 'London', firstname: 'Rupert'}),\n",
       "  'type(r)': 'IS_MARRIED_TO',\n",
       "  'b': (_2:Person {age: 24, city: 'London', firstname: 'Katherine'})},\n",
       " {'a': (_0:Person {age: 24, city: 'London', firstname: 'Rupert'}),\n",
       "  'type(r)': 'KNOWS',\n",
       "  'b': (_1:Person {age: 21, firstname: 'Nargess'})},\n",
       " {'a': (_1:Person {age: 21, firstname: 'Nargess'}),\n",
       "  'type(r)': 'LIKES',\n",
       "  'b': (_3:Hobby {name: 'Sailing'})},\n",
       " {'a': (_1:Person {age: 21, firstname: 'Nargess'}),\n",
       "  'type(r)': 'LIKES',\n",
       "  'b': (_4:Hobby {name: 'Travelling'})},\n",
       " {'a': (_1:Person {age: 21, firstname: 'Nargess'}),\n",
       "  'type(r)': 'KNOWS',\n",
       "  'b': (_0:Person {age: 24, city: 'London', firstname: 'Rupert'})},\n",
       " {'a': (_2:Person {age: 24, city: 'London', firstname: 'Katherine'}),\n",
       "  'type(r)': 'LIKES',\n",
       "  'b': (_4:Hobby {name: 'Travelling'})},\n",
       " {'a': (_2:Person {age: 24, city: 'London', firstname: 'Katherine'}),\n",
       "  'type(r)': 'IS_MARRIED_TO',\n",
       "  'b': (_0:Person {age: 24, city: 'London', firstname: 'Rupert'})},\n",
       " {'a': (_3:Hobby {name: 'Sailing'}),\n",
       "  'type(r)': 'LIKES',\n",
       "  'b': (_1:Person {age: 21, firstname: 'Nargess'})},\n",
       " {'a': (_4:Hobby {name: 'Travelling'}),\n",
       "  'type(r)': 'LIKES',\n",
       "  'b': (_2:Person {age: 24, city: 'London', firstname: 'Katherine'})},\n",
       " {'a': (_4:Hobby {name: 'Travelling'}),\n",
       "  'type(r)': 'LIKES',\n",
       "  'b': (_1:Person {age: 21, firstname: 'Nargess'})},\n",
       " {'a': (_5:Hobby {name: 'Champagne'}),\n",
       "  'type(r)': 'LIKES',\n",
       "  'b': (_0:Person {age: 24, city: 'London', firstname: 'Rupert'})}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"MATCH (a)-[r]-(b) RETURN a, type(r), b\"\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'person': (_156:Person {age: 24, city: 'London', firstname: 'Katherine'})},\n",
       " {'person': (_155:Person {age: 21, firstname: 'Nargess'})}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"MATCH (rupert:Person { firstname: 'Rupert'})-->(person:Person) RETURN person\"\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'rupert': (_154:Person {age: 24, city: 'London', firstname: 'Rupert'}),\n",
       "  'person': (_156:Person {age: 24, city: 'London', firstname: 'Katherine'})},\n",
       " {'rupert': (_154:Person {age: 24, city: 'London', firstname: 'Rupert'}),\n",
       "  'person': (_155:Person {age: 21, firstname: 'Nargess'})}]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"MATCH (rupert:Person { firstname: 'Rupert'})-->(person:Person) RETURN rupert, person\"\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'rupert': (_154:Person {age: 24, city: 'London', firstname: 'Rupert'}),\n",
       "  'type(r)': 'IS_MARRIED_TO',\n",
       "  'person': (_156:Person {age: 24, city: 'London', firstname: 'Katherine'})},\n",
       " {'rupert': (_154:Person {age: 24, city: 'London', firstname: 'Rupert'}),\n",
       "  'type(r)': 'KNOWS',\n",
       "  'person': (_155:Person {age: 21, firstname: 'Nargess'})}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"MATCH (rupert:Person { firstname: 'Rupert'})-[r]->(person:Person) RETURN rupert, type(r), person\"\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'person': (_156:Person {age: 24, city: 'London', firstname: 'Katherine'}),\n",
       "  'hobby': (_158:Hobby {name: 'Travelling'})},\n",
       " {'person': (_155:Person {age: 21, firstname: 'Nargess'}),\n",
       "  'hobby': (_157:Hobby {name: 'Sailing'})},\n",
       " {'person': (_155:Person {age: 21, firstname: 'Nargess'}),\n",
       "  'hobby': (_158:Hobby {name: 'Travelling'})}]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"MATCH (rupert:Person { firstname: 'Rupert'})-->(person)-[:LIKES]->(hobby) RETURN person, hobby\"\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'person': (_156:Person {age: 24, city: 'London', firstname: 'Katherine'}),\n",
       "  'COUNT(hobby)': 1},\n",
       " {'person': (_155:Person {age: 21, firstname: 'Nargess'}), 'COUNT(hobby)': 2}]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"MATCH (rupert:Person { firstname: 'Rupert'})-->(person)-[:LIKES]->(hobby) RETURN person, COUNT(hobby)\"\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(*)': 6}]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = 'MATCH (n) RETURN count(*)'\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "####\n",
    "## HILLARY CLINTONS emails\n",
    "\n",
    "## In the Neo4j Browser:\n",
    "LOAD CSV WITH HEADERS\n",
    "FROM 'https://s3-eu-west-1.amazonaws.com/csparkdata/clinton-emails.csv'\n",
    "AS line\n",
    "RETURN count(*)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "D:\\cambADSLDN\\ads05\\06-graph/data/clinton-emails.csv\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "# make sure current working directory is where you launched the notebook\n",
    "# You can use this path to the data instead of the url if the download is too slow\n",
    "cwd = os.getcwd()\n",
    "clinton_emails_file = cwd + \"/data/clinton-emails.csv\"\n",
    "print(clinton_emails_file)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"USING PERIODIC COMMIT \\\n",
    "LOAD CSV WITH HEADERS FROM 'https://s3-eu-west-1.amazonaws.com/csparkdata/clinton-emails.csv' AS line \\\n",
    "MERGE (fr:Person {alias: COALESCE(line.MetadataFrom, line.ExtractedFrom, '')}) \\\n",
    "MERGE (to:Person {alias: COALESCE(line.MetadataTo, line.ExtractedTo, '')}) \\\n",
    "MERGE (cc:Person {alias: COALESCE(line.ExtractedCc, '')}) \\\n",
    "MERGE (fr)-[:SENT_EMAIL_TO]->(to) \\\n",
    "MERGE (fr)-[:CC_EMAIL_TO]->(cc)\"\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'COUNT(n)': 4}]"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "## 1) Find the number of people that haved emailed themselves (a loop)\n",
    "query = \"MATCH (n)-[:SENT_EMAIL_TO]->(n) RETURN COUNT(n)\"\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_1:Person {alias: 'B6'})},\n",
       " {'n': (_160:Person {alias: 'Sullivan, Jake'}),\n",
       "  'p': (_2:Person {alias: 'Schwerin, Daniel B'})},\n",
       " {'n': (_160:Person {alias: 'Sullivan, Jake'}),\n",
       "  'p': (_3:Person {alias: 'Reines, Philippe'})},\n",
       " {'n': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'p': (_5:Person {alias: 'Valmoro, Lona'})},\n",
       " {'n': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'p': (_5:Person {alias: 'Valmoro, Lona'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_5:Person {alias: 'Valmoro, Lona'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_6:Person {alias: 'Nides, Thomas R'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_8:Person {alias: 'Otero, Maria'})},\n",
       " {'n': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'p': (_15:Person {alias: 'Jiloty, Lauren'})},\n",
       " {'n': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'p': (_15:Person {alias: 'Jiloty, Lauren'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_15:Person {alias: 'Jiloty, Lauren'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_24:Person {alias: 'wburns'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_26:Person {alias: 'Muscatine, Lissa'})},\n",
       " {'n': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'p': (_26:Person {alias: 'Muscatine, Lissa'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_30:Person {alias: 'sbwhoeop'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_34:Person {alias: 'reinesp@state.gov'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_47:Person {alias: 'Balderston, Kris'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_48:Person {alias: 'Verma, Richard'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_62:Person {alias: 'preines'})},\n",
       " {'n': (_165:Person {alias: 'Koh, Harold Hongju'}),\n",
       "  'p': (_72:Person {alias: 'Feltman, Jeffrey D'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_78:Person {alias: 'capriciamarshall'})},\n",
       " {'n': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'p': (_78:Person {alias: 'capriciamarshall'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_84:Person {alias: 'lmuscatine'})},\n",
       " {'n': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'p': (_100:Person {alias: 'Ebeling, Voda'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_107:Person {alias: 'daniel.baer'})},\n",
       " {'n': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'p': (_160:Person {alias: 'Sullivan, Jake'})},\n",
       " {'n': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'p': (_160:Person {alias: 'Sullivan, Jake'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_160:Person {alias: 'Sullivan, Jake'})},\n",
       " {'n': (_3:Person {alias: 'Reines, Philippe'}),\n",
       "  'p': (_160:Person {alias: 'Sullivan, Jake'})},\n",
       " {'n': (_2:Person {alias: 'Schwerin, Daniel B'}),\n",
       "  'p': (_160:Person {alias: 'Sullivan, Jake'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_161:Person {alias: ''})},\n",
       " {'n': (_26:Person {alias: 'Muscatine, Lissa'}),\n",
       "  'p': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'n': (_15:Person {alias: 'Jiloty, Lauren'}),\n",
       "  'p': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'n': (_5:Person {alias: 'Valmoro, Lona'}),\n",
       "  'p': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'n': (_160:Person {alias: 'Sullivan, Jake'}),\n",
       "  'p': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'n': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'p': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'n': (_6:Person {alias: 'Nides, Thomas R'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_78:Person {alias: 'capriciamarshall'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_1:Person {alias: 'B6'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_84:Person {alias: 'lmuscatine'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_62:Person {alias: 'preines'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_160:Person {alias: 'Sullivan, Jake'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_8:Person {alias: 'Otero, Maria'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_47:Person {alias: 'Balderston, Kris'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_26:Person {alias: 'Muscatine, Lissa'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_15:Person {alias: 'Jiloty, Lauren'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_161:Person {alias: ''}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_107:Person {alias: 'daniel.baer'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_30:Person {alias: 'sbwhoeop'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_48:Person {alias: 'Verma, Richard'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_34:Person {alias: 'reinesp@state.gov'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_5:Person {alias: 'Valmoro, Lona'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_24:Person {alias: 'wburns'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'p': (_163:Person {alias: 'Clinton, Hillary'})},\n",
       " {'n': (_72:Person {alias: 'Feltman, Jeffrey D'}),\n",
       "  'p': (_165:Person {alias: 'Koh, Harold Hongju'})},\n",
       " {'n': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'p': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'n': (_78:Person {alias: 'capriciamarshall'}),\n",
       "  'p': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'n': (_15:Person {alias: 'Jiloty, Lauren'}),\n",
       "  'p': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'n': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'p': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'n': (_100:Person {alias: 'Ebeling, Voda'}),\n",
       "  'p': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'n': (_160:Person {alias: 'Sullivan, Jake'}),\n",
       "  'p': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'n': (_5:Person {alias: 'Valmoro, Lona'}),\n",
       "  'p': (_169:Person {alias: 'Abedin, Huma'})}]"
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "## 2) Find the people that have emailed someone who has also emailed them (a cycle)\n",
    "query = \"MATCH (n)-[:SENT_EMAIL_TO]->(p)-[:SENT_EMAIL_TO]->(n) RETURN n, p\"\n",
    "graph.run(query).data()\n",
    "\n",
    "## 64 rows affected."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'sender': (_0:Person {alias: 'Hanley, Monica R'}),\n",
       "  'receiver': (_2:Person {alias: 'Schwerin, Daniel B'}),\n",
       "  'cc': (_0:Person {alias: 'Hanley, Monica R'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_3:Person {alias: 'Reines, Philippe'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_5:Person {alias: 'Valmoro, Lona'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_5:Person {alias: 'Valmoro, Lona'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_9:Person {alias: 'McHale, Judith'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_15:Person {alias: 'Jiloty, Lauren'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_15:Person {alias: 'Jiloty, Lauren'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_26:Person {alias: 'Muscatine, Lissa'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_29:Person {alias: 'Lew, Jacob'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_35:Person {alias: 'Talbott, Strobe'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_47:Person {alias: 'Balderston, Kris'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_47:Person {alias: 'Balderston, Kris'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_48:Person {alias: 'Verma, Richard'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_48:Person {alias: 'Verma, Richard'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_62:Person {alias: 'preines'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_68:Person {alias: 'Rubiner, Laurie'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_73:Person {alias: 'Crowley, Philip'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_78:Person {alias: 'capriciamarshall'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_100:Person {alias: 'Ebeling, Voda'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_137:Person {alias: 'Ebeling, Betsy'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_138:Person {alias: 'Beale, Courtney A Kramer'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_142:Person {alias: 'Pally, Maura M'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_2:Person {alias: 'Schwerin, Daniel B'}),\n",
       "  'receiver': (_160:Person {alias: 'Sullivan, Jake'}),\n",
       "  'cc': (_2:Person {alias: 'Schwerin, Daniel B'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_160:Person {alias: 'Sullivan, Jake'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_0:Person {alias: 'Hanley, Monica R'}),\n",
       "  'receiver': (_160:Person {alias: 'Sullivan, Jake'}),\n",
       "  'cc': (_0:Person {alias: 'Hanley, Monica R'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_160:Person {alias: 'Sullivan, Jake'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_161:Person {alias: ''}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_161:Person {alias: ''}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_26:Person {alias: 'Muscatine, Lissa'}),\n",
       "  'receiver': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'cc': (_26:Person {alias: 'Muscatine, Lissa'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_26:Person {alias: 'Muscatine, Lissa'}),\n",
       "  'receiver': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'cc': (_26:Person {alias: 'Muscatine, Lissa'})},\n",
       " {'sender': (_2:Person {alias: 'Schwerin, Daniel B'}),\n",
       "  'receiver': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'cc': (_2:Person {alias: 'Schwerin, Daniel B'})},\n",
       " {'sender': (_74:Person {alias: 'Mitchell, George'}),\n",
       "  'receiver': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'cc': (_74:Person {alias: 'Mitchell, George'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_0:Person {alias: 'Hanley, Monica R'}),\n",
       "  'receiver': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'cc': (_0:Person {alias: 'Hanley, Monica R'})},\n",
       " {'sender': (_170:Person {alias: 'Russo, Robert V'}),\n",
       "  'receiver': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'cc': (_170:Person {alias: 'Russo, Robert V'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_163:Person {alias: 'Clinton, Hillary'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_164:Person {alias: 'Slaughter, Anne-Marie'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_164:Person {alias: 'Slaughter, Anne-Marie'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_26:Person {alias: 'Muscatine, Lissa'}),\n",
       "  'receiver': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'cc': (_26:Person {alias: 'Muscatine, Lissa'})},\n",
       " {'sender': (_0:Person {alias: 'Hanley, Monica R'}),\n",
       "  'receiver': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'cc': (_0:Person {alias: 'Hanley, Monica R'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_208:Person {alias: 'Flores, Oscar'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_208:Person {alias: 'Flores, Oscar'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_209:Person {alias: 'hanleymr@state.gov'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_170:Person {alias: 'Russo, Robert V'}),\n",
       "  'receiver': (_246:Person {alias: 'doug'}),\n",
       "  'cc': (_170:Person {alias: 'Russo, Robert V'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_257:Person {alias: 'williamsbarrett'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_262:Person {alias: 'Cue, Lourdes C'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_264:Person {alias: 'H2'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_266:Person {alias: 'cmarshall'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_268:Person {alias: 'Luzzatto'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_274:Person {alias: 'Howe, Rosemarie'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_276:Person {alias: 'donald'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_277:Person {alias: 'rosemarie.howe ;H'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_278:Person {alias: 'Preval, Rene'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_279:Person {alias: 'mark'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_281:Person {alias: 'Cooper, Justin'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_281:Person {alias: 'Cooper, Justin'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_283:Person {alias: 'Posner, Michael'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_284:Person {alias: 'rrh.interiors'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_169:Person {alias: 'Abedin, Huma'}),\n",
       "  'receiver': (_287:Person {alias: 'mh.interiors'}),\n",
       "  'cc': (_169:Person {alias: 'Abedin, Huma'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_288:Person {alias: 'Kennedy, Jim'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_289:Person {alias: 'Berger, Samuel R'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_299:Person {alias: 'Edwards, Christopher'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_300:Person {alias: 'Toiv, Nora F'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_305:Person {alias: 'Bond, Michele T'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_310:Person {alias: 'Band, Doug'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_312:Person {alias: 'LGraham'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_314:Person {alias: 'Grantham, Suzanne L'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})},\n",
       " {'sender': (_170:Person {alias: 'Russo, Robert V'}),\n",
       "  'receiver': (_320:Person {alias: 'Betsy.Ebeling'}),\n",
       "  'cc': (_170:Person {alias: 'Russo, Robert V'})},\n",
       " {'sender': (_162:Person {alias: 'Mills, Cheryl'}),\n",
       "  'receiver': (_337:Person {alias: 'Jacobs, Janice L'}),\n",
       "  'cc': (_162:Person {alias: 'Mills, Cheryl'})}]"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "## 3) Find the people that haved emailed someone and have ccd themselves\n",
    "query = \"MATCH (n)-[:SENT_EMAIL_TO]->(p), (n)-[:CC_EMAIL_TO]->(n) WHERE n.alias <> '' RETURN n as sender, p as receiver, n as cc\"\n",
    "graph.run(query).data()\n",
    "\n",
    "## 73 rows affected."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': (_10:Person {alias: 'Alec'})},\n",
       " {'p': (_11:Person {alias: 'Pelton, E'})},\n",
       " {'p': (_12:Person {alias: 'NEA/PI/CE:Kiamie, Charles'})},\n",
       " {'p': (_14:Person {alias: 'Norman, Nicholas'})},\n",
       " {'p': (_27:Person {alias: 'NHLA'})},\n",
       " {'p': (_32:Person {alias: 'Long Term Strategy Group'})},\n",
       " {'p': (_33:Person {alias: 'PRM/MCE:Wills,G'})},\n",
       " {'p': (_36:Person {alias: 'INL:Johnson, David T'})},\n",
       " {'p': (_37:Person {alias: 'EAP/K:Rosenberger, L'})},\n",
       " {'p': (_38:Person {alias: 'Brown, Lee R'})},\n",
       " {'p': (_41:Person {alias: 'FINCA International'})},\n",
       " {'p': (_44:Person {alias: 'White House'})},\n",
       " {'p': (_46:Person {alias: 'Jake.sullivan'})},\n",
       " {'p': (_50:Person {alias: 'Colin Powell'})},\n",
       " {'p': (_51:Person {alias: 'Sanchez, Oscar Arias'})},\n",
       " {'p': (_55:Person {alias: 'Garten, David (Lautenberg)'})},\n",
       " {'p': (_57:Person {alias: 'BAM@Mikulski.senate.gov'})},\n",
       " {'p': (_59:Person {alias: '111th Congress'})},\n",
       " {'p': (_66:Person {alias: 'CdeBaca, Luis'})},\n",
       " {'p': (_67:Person {alias: 'Lou de Bac, G/TIP'})},\n",
       " {'p': (_70:Person {alias: 'Ilic, Werner X'})},\n",
       " {'p': (_75:Person {alias: 'AGNA USEMB Kabul Afghanistan'})},\n",
       " {'p': (_76:Person {alias: 'DS/PA:Finkle, J'})},\n",
       " {'p': (_80:Person {alias: 'Secretary'})},\n",
       " {'p': (_81:Person {alias: 'Prime Minister'})},\n",
       " {'p': (_82:Person {alias: 'Kelly, Ian'})},\n",
       " {'p': (_83:Person {alias: 'State'})},\n",
       " {'p': (_85:Person {alias: 'Faleomavaega, Eni F'})},\n",
       " {'p': (_92:Person {alias: 'Politico - Drew, Elizabeth'})},\n",
       " {'p': (_93:Person {alias: 'U.S. Global Leadership Coalition'})},\n",
       " {'p': (_104:Person {alias: 'S/SRGIA'})},\n",
       " {'p': (_114:Person {alias: 'EAP/J:Green, Christopher'})},\n",
       " {'p': (_116:Person {alias: 'EUR/RUS:Weson, Chad'})},\n",
       " {'p': (_118:Person {alias: 'Richards, Cecile'})},\n",
       " {'p': (_119:Person {alias: 'Mayock, Andrew'})},\n",
       " {'p': (_120:Person {alias: 'Washington Post'})},\n",
       " {'p': (_121:Person {alias: 'Hoagland, Jim'})},\n",
       " {'p': (_122:Person {alias: 'Tillemann, Tomicah S'})},\n",
       " {'p': (_126:Person {alias: 'Haiti'})},\n",
       " {'p': (_128:Person {alias: 'NEA/IPA:Knopf, Payton'})},\n",
       " {'p': (_131:Person {alias: 'McGovern, James P'})},\n",
       " {'p': (_141:Person {alias: 'Jiloty, Cheryl D'})},\n",
       " {'p': (_142:Person {alias: 'Pally, Maura M'})},\n",
       " {'p': (_144:Person {alias: 'Collier, Paul'})},\n",
       " {'p': (_145:Person {alias: 'Dupuy, Alex'})},\n",
       " {'p': (_148:Person {alias: 'AP'})},\n",
       " {'p': (_149:Person {alias: 'Elbegdori, Tsakina'})},\n",
       " {'p': (_150:Person {alias: 'New York Times'})},\n",
       " {'p': (_151:Person {alias: 'AF/PDPA:Scott, Marianne'})},\n",
       " {'p': (_154:Person {age: 24, city: 'London', firstname: 'Rupert'})},\n",
       " {'p': (_155:Person {age: 21, firstname: 'Nargess'})},\n",
       " {'p': (_156:Person {age: 24, city: 'London', firstname: 'Katherine'})},\n",
       " {'p': (_157:Hobby {name: 'Sailing'})},\n",
       " {'p': (_158:Hobby {name: 'Travelling'})},\n",
       " {'p': (_159:Hobby {name: 'Champagne'})},\n",
       " {'p': (_174:Person {alias: 'Secretary of State'})},\n",
       " {'p': (_176:Person {alias: 'Sandy'})},\n",
       " {'p': (_177:Person {alias: 'Foreign Affairs Magazine'})},\n",
       " {'p': (_180:Person {alias: 'Diamond, Louise'})},\n",
       " {'p': (_181:Person {alias: 'Crocker, Chester A'})},\n",
       " {'p': (_185:Person {alias: 'Inonye, Daniel'})},\n",
       " {'p': (_187:Person {alias: 'Kieffer, Judith'})},\n",
       " {'p': (_189:Person {alias: 'JAMA'})},\n",
       " {'p': (_191:Person {alias: 'Zaidi, S Akbar'})},\n",
       " {'p': (_192:Person {alias: 'Calivis, Maria'})},\n",
       " {'p': (_194:Person {alias: 'Heintz'})},\n",
       " {'p': (_199:Person {alias: 'Chelsea'})},\n",
       " {'p': (_200:Person {alias: 'latimes.com'})},\n",
       " {'p': (_202:Person {alias: 'Brock, David'})},\n",
       " {'p': (_203:Person {alias: 'Daily Sun'})},\n",
       " {'p': (_204:Person {alias: 'Huma@clintonemail.com'})},\n",
       " {'p': (_205:Person {alias: 'Opinion Research'})},\n",
       " {'p': (_206:Person {alias: 'Russorv@state.gov'})},\n",
       " {'p': (_207:Person {alias: 'Sherman, Wendy R'})},\n",
       " {'p': (_208:Person {alias: 'Flores, Oscar'})},\n",
       " {'p': (_209:Person {alias: 'hanleymr@state.gov'})},\n",
       " {'p': (_210:Person {alias: 'Burnswj@state.gov'})},\n",
       " {'p': (_211:Person {alias: 'Jake.Sullivan'})},\n",
       " {'p': (_212:Person {alias: 'michele.flournoy'})},\n",
       " {'p': (_213:Person {alias: 'Cheryl'})},\n",
       " {'p': (_214:Person {alias: 'brian'})},\n",
       " {'p': (_215:Person {alias: 'bam@mikulski.senate.gov'})},\n",
       " {'p': (_216:Person {alias: 'l'})},\n",
       " {'p': (_217:Person {alias: 'ntanden'})},\n",
       " {'p': (_218:Person {alias: 'jacobjlew'})},\n",
       " {'p': (_219:Person {alias: 'rsloan'})},\n",
       " {'p': (_220:Person {alias: 'stalbott'})},\n",
       " {'p': (_221:Person {alias: 'SteinbergJB@state.gov'})},\n",
       " {'p': (_222:Person {alias: 'mhcaleja@state.gov'})},\n",
       " {'p': (_223:Person {alias: 'jpodesta'})},\n",
       " {'p': (_224:Person {alias: 'wsherman'})},\n",
       " {'p': (_225:Person {alias: 'cholletdh@state.gov'})},\n",
       " {'p': (_226:Person {alias: 'BStrider'})},\n",
       " {'p': (_227:Person {alias: 'jfarrow'})},\n",
       " {'p': (_228:Person {alias: 'Axelrod_D'})},\n",
       " {'p': (_229:Person {alias: 'SBerger'})},\n",
       " {'p': (_230:Person {alias: 'shapiroa@state.gov'})},\n",
       " {'p': (_231:Person {alias: 'David_Garten@lautenberg.senate.gov'})},\n",
       " {'p': (_232:Person {alias: 'verveerms@state.gov'})},\n",
       " {'p': (_233:Person {alias: 'kohhh@state.gov'})},\n",
       " {'p': (_234:Person {alias: 'lewjj@state.gov'})},\n",
       " {'p': (_235:Person {alias: 'TFlourno'})},\n",
       " {'p': (_236:Person {alias: 'cb'})},\n",
       " {'p': (_237:Person {alias: 'pverveer'})},\n",
       " {'p': (_238:Person {alias: 'jpiercy'})},\n",
       " {'p': (_239:Person {alias: 'FuchsMH@state.gov'})},\n",
       " {'p': (_240:Person {alias: 'CHERIE BLAIR'})},\n",
       " {'p': (_241:Person {alias: 'Terry.Duffy'})},\n",
       " {'p': (_242:Person {alias: 'crowleypj@state.gov'})},\n",
       " {'p': (_243:Person {alias: 'CampbellKM@state.gov'})},\n",
       " {'p': (_244:Person {alias: 'rooneym@state.gov'})},\n",
       " {'p': (_245:Person {alias: 'sgration'})},\n",
       " {'p': (_246:Person {alias: 'doug'})},\n",
       " {'p': (_247:Person {alias: 'nancy'})},\n",
       " {'p': (_248:Person {alias: 'KellyC@state.gov'})},\n",
       " {'p': (_249:Person {alias: 'HolbrookeRC@state.gov'})},\n",
       " {'p': (_250:Person {alias: 'caputol'})},\n",
       " {'p': (_251:Person {alias: 'gordonph@state.gov'})},\n",
       " {'p': (_252:Person {alias: 'captuol'})},\n",
       " {'p': (_253:Person {alias: 'slaughtera@state.gov'})},\n",
       " {'p': (_254:Person {alias: 'rodriguezme@state.gov'})},\n",
       " {'p': (_255:Person {alias: 'mtorrey'})},\n",
       " {'p': (_256:Person {alias: 'glantz.'})},\n",
       " {'p': (_257:Person {alias: 'williamsbarrett'})},\n",
       " {'p': (_258:Person {alias: 'hillcr@state.gov'})},\n",
       " {'p': (_259:Person {alias: 'tauschereo@state.gov'})},\n",
       " {'p': (_260:Person {alias: 'feltmanjd@state.gov'})},\n",
       " {'p': (_261:Person {alias: 'baer.daniel'})},\n",
       " {'p': (_262:Person {alias: 'Cue, Lourdes C'})},\n",
       " {'p': (_263:Person {alias: 'Hill'})},\n",
       " {'p': (_264:Person {alias: 'H2'})},\n",
       " {'p': (_265:Person {alias: 'carsonj@state.gov'})},\n",
       " {'p': (_266:Person {alias: 'cmarshall'})},\n",
       " {'p': (_267:Person {alias: 'shannonta@state.gov'})},\n",
       " {'p': (_268:Person {alias: 'Luzzatto'})},\n",
       " {'p': (_269:Person {alias: 'Department of State'})},\n",
       " {'p': (_270:Person {alias: 'marshallcp@state.gov'})},\n",
       " {'p': (_271:Person {alias: 'Madam Secretary'})},\n",
       " {'p': (_272:Person {alias: 'Lew'})},\n",
       " {'p': (_273:Person {alias: 'Eikenberry, Karl W'})},\n",
       " {'p': (_274:Person {alias: 'Howe, Rosemarie'})},\n",
       " {'p': (_275:Person {alias: 'hr15@mycingular.blackberry.net'})},\n",
       " {'p': (_276:Person {alias: 'donald'})},\n",
       " {'p': (_277:Person {alias: 'rosemarie.howe ;H'})},\n",
       " {'p': (_278:Person {alias: 'Preval, Rene'})},\n",
       " {'p': (_279:Person {alias: 'mark'})},\n",
       " {'p': (_280:Person {alias: 'hormatsrd@state.gov'})},\n",
       " {'p': (_281:Person {alias: 'Cooper, Justin'})},\n",
       " {'p': (_282:Person {alias: 'sterntd@state.gov'})},\n",
       " {'p': (_283:Person {alias: 'Posner, Michael'})},\n",
       " {'p': (_284:Person {alias: 'rrh.interiors'})},\n",
       " {'p': (_285:Person {alias: 'Council on Foreign Relations'})},\n",
       " {'p': (_286:Person {alias: 'SchwerinDB@state.gov'})},\n",
       " {'p': (_287:Person {alias: 'mh.interiors'})},\n",
       " {'p': (_288:Person {alias: 'Kennedy, Jim'})},\n",
       " {'p': (_289:Person {alias: 'Berger, Samuel R'})},\n",
       " {'p': (_290:Person {alias: 'Biography'})},\n",
       " {'p': (_291:Person {alias: 'Mills, Cheryl D'})},\n",
       " {'p': (_292:Person {alias: 'Kabul LGF Request'})},\n",
       " {'p': (_293:Person {alias: 'Sir'})},\n",
       " {'p': (_294:Person {alias: 'Ki-moon, Ban'})},\n",
       " {'p': (_295:Person {alias: 'Robinson, Peter'})},\n",
       " {'p': (_296:Person {alias: 'ASUNCION'})},\n",
       " {'p': (_297:Person {alias: 'WHADP'})},\n",
       " {'p': (_298:Person {alias: 'Reynolds, Diane'})},\n",
       " {'p': (_299:Person {alias: 'Edwards, Christopher'})},\n",
       " {'p': (_300:Person {alias: 'Toiv, Nora F'})},\n",
       " {'p': (_301:Person {alias: 'Mills, Cheryl D; Toiv, Nora F; Sullivan, Jacob 3; Ross, Alec J; Slaughter, Anne-Marie; ChoIlet, Derek H; Crowley, Philip'})},\n",
       " {'p': (_302:Person {alias: 'Estados Unidos De NorteAmerica'})},\n",
       " {'p': (_303:Person {alias: 'United States of America'})},\n",
       " {'p': (_304:Person {alias: \"Etat-Unis D'Amerique\"})},\n",
       " {'p': (_305:Person {alias: 'Bond, Michele T'})},\n",
       " {'p': (_306:Person {alias: 'Estados Unidos Da America'})},\n",
       " {'p': (_307:Person {alias: 'Govenman Etazini'})},\n",
       " {'p': (_308:Person {alias: 'Hattaway, Doug'})},\n",
       " {'p': (_309:Person {alias: 'Pascual, Carlos'})},\n",
       " {'p': (_310:Person {alias: 'Band, Doug'})},\n",
       " {'p': (_311:Person {alias: 'Obama, Barack'})},\n",
       " {'p': (_312:Person {alias: 'LGraham'})},\n",
       " {'p': (_313:Person {alias: 'Olver, John'})},\n",
       " {'p': (_314:Person {alias: 'Grantham, Suzanne L'})},\n",
       " {'p': (_315:Person {alias: 'Klehr, Bonnie'})},\n",
       " {'p': (_316:Person {alias: 'Clinton, William J'})},\n",
       " {'p': (_317:Person {alias: 'HRC'})},\n",
       " {'p': (_318:Person {alias: 'Harris, Jennifer M'})},\n",
       " {'p': (_319:Person {alias: 'Sullivan, Jacob H'})},\n",
       " {'p': (_320:Person {alias: 'Betsy.Ebeling'})},\n",
       " {'p': (_321:Person {alias: 'Duk-soo, Han'})},\n",
       " {'p': (_322:Person {alias: 'Conrad, Kent'})},\n",
       " {'p': (_323:Person {alias: 'Hubbard, William'})},\n",
       " {'p': (_324:Person {alias: 'Robinson, Jennifer'})},\n",
       " {'p': (_325:Person {alias: 'President'})},\n",
       " {'p': (_326:Person {alias: 'brimmere@state.gov'})},\n",
       " {'p': (_327:Person {alias: 'rshah'})},\n",
       " {'p': (_328:Person {alias: 'valenzuelaaa@state.gov'})},\n",
       " {'p': (_329:Person {alias: 'Rice, Susan E.'})},\n",
       " {'p': (_330:Person {alias: 'mchaleja@state.gov'})},\n",
       " {'p': (_331:Person {alias: 'toivnf@state.gov'})},\n",
       " {'p': (_332:Person {alias: 'TillemannTS@state.gov'})},\n",
       " {'p': (_333:Person {alias: 'markjpenn'})},\n",
       " {'p': (_334:Person {alias: 'Dad'})},\n",
       " {'p': (_335:Person {alias: 'bealeca@state.gov'})},\n",
       " {'p': (_336:Person {alias: 'lynn'})},\n",
       " {'p': (_337:Person {alias: 'Jacobs, Janice L'})},\n",
       " {'p': (_338:Person {alias: 'Daniel'})},\n",
       " {'p': (_339:Person {alias: 'Mitchell, Andrew B'})},\n",
       " {'p': (_340:Person {alias: 'S_SpecialAssistants'})},\n",
       " {'p': (_341:Person {alias: 'Escrogirna, Ana A; Grantham, Chris W'})},\n",
       " {'p': (_342:Person {alias: 'Escrogima, Ana A'})},\n",
       " {'p': (_343:Person {alias: 'Escrogima, Ana A; Grantham, Chris W'})},\n",
       " {'p': (_344:Person {alias: 'McEldowney, Nancy E; Heffern, John A; Spence, Matthew 3.'})},\n",
       " {'p': (_345:Person {alias: 'Macmanus, Joseph E (S[)ialAssistants; Abbaszadeh, Nima; Coleman, Claire L'})},\n",
       " {'p': (_346:Person {alias: 'Sullivan, Jacob .1'})},\n",
       " {'p': (_347:Person {alias: 'Goldberger, Thomas H; Gardner, Rebecca V B6'})},\n",
       " {'p': (_348:Person {alias: 'Huma Abedin; Abedin, Huma; Hanley, Monica R; Valmoro, Lona i; Coleman, Claire'})},\n",
       " {'p': (_349:Person {alias: 'Miller, James N; Blair, Oni K; Lakhdhir, Kamala S; Austin-Ferguson, Kathleen T; Lohman, Lee'})},\n",
       " {'p': (_350:Person {alias: 'Huma Abedin'})},\n",
       " {'p': (_351:Person {alias: 'Boswell, Eric J'})},\n",
       " {'p': (_352:Person {alias: 'Kalmbach, Heather E; Keene, Matt E'})},\n",
       " {'p': (_353:Person {alias: 'Reines, Philippe I; Mills, Cheryl D; Adams, David S'})},\n",
       " {'p': (_354:Person {alias: 'Reines, Philippe 1; Mills, Cheryl D; Adams, David S'})},\n",
       " {'p': (_355:Person {alias: 'Sullivan, Jacob J; Abedin, Hurna; Hanley, Monica R'})},\n",
       " {'p': (_356:Person {alias: 'Hume Abedin'})},\n",
       " {'p': (_357:Person {alias: 'Sullivan, Jacob 3; Abedin, Huma; Hanley, Monica R'})},\n",
       " {'p': (_358:Person {alias: 'Sullivan, Jacob J; Abedin, Huma'})},\n",
       " {'p': (_359:Person {alias: 'Sullivan, Jacob 3; Abedin, Hume; Hanley, Monica R'})},\n",
       " {'p': (_360:Person {alias: 'Burns, William 3; Welk, Alice G; Sanderson, Janet A'})},\n",
       " {'p': (_361:Person {alias: 'Adler Caroline E'})},\n",
       " {'p': (_362:Person {alias: 'Hurna Abedin'})},\n",
       " {'p': (_363:Person {alias: \"'SchwerinDB@state.gov.\"})},\n",
       " {'p': (_364:Person {alias: 'Hanley, Monica R; Abedin, Huma'})},\n",
       " {'p': (_365:Person {alias: 'Toiv, Nora F; Laszczych, Joanne; Austin-Ferguson, Kathleen T'})},\n",
       " {'p': (_366:Person {alias: 'Ford, Robert S; Dibble, Elizabeth L'})},\n",
       " {'p': (_367:Person {alias: 'Mills, Cheryl D; Reines, Philippe I'})},\n",
       " {'p': (_368:Person {alias: 'SES-O; SES_DutyDeputies'})},\n",
       " {'p': (_369:Person {alias: 'Mills, Cheryl 0; Reines, Philippe I'})},\n",
       " {'p': (_370:Person {alias: 'jiloty, Lauren C'})},\n",
       " {'p': (_371:Person {alias: 'SES-0; SES_DutyDeputies'})},\n",
       " {'p': (_372:Person {alias: 'S_SpeclalAssigants'})},\n",
       " {'p': (_373:Person {alias: 'Mills, Cheryl D <MillsCD@state.gov>'})},\n",
       " {'p': (_374:Person {alias: 'S_SpecialAssistarits'})},\n",
       " {'p': (_375:Person {alias: 'Cheryl Mills Maggie Williams'})},\n",
       " {'p': (_376:Person {alias: 'Huma Abedin; Abedin, Hurna;'})},\n",
       " {'p': (_377:Person {alias: 'COM; Jake Sullivan'})},\n",
       " {'p': (_378:Person {alias: \"O'Connell, Andrew M; Johnson, Brock A; Boswell, Eric J\"})},\n",
       " {'p': (_379:Person {alias: 'Sullivan, Jacobi; Reines, Philippe'})},\n",
       " {'p': (_380:Person {alias: 'Sullivan, Jacob'})},\n",
       " {'p': (_381:Person {alias: 'Hanley, Monica R; Abedin, Hume'})},\n",
       " {'p': (_382:Person {alias: 'Sullivan, Jacob J; Valmoro, Lona J; Abedin, Huma'})},\n",
       " {'p': (_383:Person {alias: 'Dibble, Elizabeth 1; Roebuck, William V'})},\n",
       " {'p': (_384:Person {alias: 'Bums, William 3'})},\n",
       " {'p': (_385:Person {alias: 'Burns, William 3'})},\n",
       " {'p': (_386:Person {alias: 'Kennedy, Patrick F; Reines, Philippe I'})},\n",
       " {'p': (_387:Person {alias: \"Kennedy, Patrick F; Reines, Philippe'\"})},\n",
       " {'p': (_388:Person {alias: \"Alba, Joann G; Samuelson, Heather F; Mehlenbacher, Kelly J; 'Johnson, Dann', Starke, Petra; 'Sobel, Charlie';\"})},\n",
       " {'p': (_389:Person {alias: \"Valmorol_j@stategov'\"})},\n",
       " {'p': (_390:Person {alias: 'Valmoro, Lona 3'})},\n",
       " {'p': (_391:Person {alias: 'Mills, Cheryl 0; Sullivan, Jacob'})},\n",
       " {'p': (_392:Person {alias: 'Kennedy, Patrick F; Reines, Philippe'})},\n",
       " {'p': (_393:Person {alias: \"'Joyce, Sean M.'; ; Haines, Avril; Brennan, John 0.; Canegallo Kristie A.\"})},\n",
       " {'p': (_394:Person {alias: 'Abet:lin, Huma; Hume Abedin; Valmoro, Lona ./'})},\n",
       " {'p': (_395:Person {alias: 'Zeya, Uzra S; Burns, William 3; Kennedy, Patrick F; Macmanus, Joseph E (S); Sullivan, Jacob J'})},\n",
       " {'p': (_396:Person {alias: 'Abedin, Hume <AbedinH\\u00ac\\u00a9state.gov\\u201a\\u00c4\\u222b; Huma Abedin; Valmoro, Lona 3 <Valmoroli@state,gov>'})},\n",
       " {'p': (_397:Person {alias: 'Hum Abedin; Abediri, Huma;'})},\n",
       " {'p': (_398:Person {alias: 'Abedin, Hurna'})},\n",
       " {'p': (_399:Person {alias: 'Abedin, Huma <AbedinH\\u00ac\\u00a9state.gov>'})},\n",
       " {'p': (_400:Person {alias: 'Abedin, Huma <AbeclInH@state.gov\\u201a\\u00c4\\u222b'})},\n",
       " {'p': (_401:Person {alias: 'Feltrnan, Jeffrey 0; Cretz, Gene A'})},\n",
       " {'p': (_402:Person {alias: 'Feltman, Jeffrey D; Cretz, Gene A'})},\n",
       " {'p': (_403:Person {alias: 'Feitman, Jeffrey D'})},\n",
       " {'p': (_404:Person {alias: 'Dibble, Elizabeth L; Maxwell, Raymond D; Sidereas, Evyenia; Stevens, John C; Roebuck, William V; SF-S-0; Sullivan,'})},\n",
       " {'p': (_405:Person {alias: 'Jones, Beth E'})},\n",
       " {'p': (_406:Person {alias: 'Mills, Cheryl D; Sullivan, Jacob J'})},\n",
       " {'p': (_407:Person {alias: 'SES-03WO'})},\n",
       " {'p': (_408:Person {alias: \"'Abedinhi@state.goV; \\\"MillsCD@state.gov'\"})},\n",
       " {'p': (_409:Person {alias: 'Abedin, Huma <AbedinH@state.gov>'})},\n",
       " {'p': (_410:Person {alias: 'Carpenter, Margaret V.W.'})},\n",
       " {'p': (_411:Person {alias: \"'HAbedir\"})},\n",
       " {'p': (_412:Person {alias: 'Kennedy, Patrick F; Verma, Richard R'})},\n",
       " {'p': (_413:Person {alias: \"'newmyer\"})},\n",
       " {'p': (_414:Person {alias: 'Russell, baniel A; Thomas, Harry K (Director General); Mills, Cheryl D'})},\n",
       " {'p': (_415:Person {alias: 'Toiv, Nora F; Mills, Cheryl D'})},\n",
       " {'p': (_416:Person {alias: 'Toiv, Nora F; Pena, Laura'})},\n",
       " {'p': (_417:Person {alias: \"'HAbedin\"})},\n",
       " {'p': (_418:Person {alias: 'Justin Cooper'})},\n",
       " {'p': (_419:Person {alias: 'Bellegarde, Daniel P; Mills, Cheryl D; Sullivan, Jacob J'})},\n",
       " {'p': (_420:Person {alias: 'Lew, Jacob J'})},\n",
       " {'p': (_421:Person {alias: 'Toiv, Nora F; Sullivan, Jacob J; Pefia, Laura; Bisdee, Sharon C; Hardy, Sharon L; Kennedy, Patrick F; Reines, Philippe I'})},\n",
       " {'p': (_422:Person {alias: 'Toiv, Nora F;'})},\n",
       " {'p': (_423:Person {alias: 'Sullivan, Jacob J <SullivanJJ@state.gov>; Mills, Cheryl D <MillsCD@state.gov>'})},\n",
       " {'p': (_424:Person {alias: 'Scanlon, Amy B; Crocker, Bathsheba N; Sullivan, Jacob J'})},\n",
       " {'p': (_425:Person {alias: 'H'})},\n",
       " {'p': (_426:Person {alias: 'Toiv, Nora F; Park, Pamela P; Friedrich, Mary K; Russell, Daniel A; Tesone, Mark; Alford, Edward M (Ned); Smith,'})},\n",
       " {'p': (_427:Person {alias: \"'sullivanij@state.gov'; 'shapiroa@state.gov'; 'preines(\"})},\n",
       " {'p': (_428:Person {alias: 'Oscar Flores'})},\n",
       " {'p': (_429:Person {alias: \"'sullivanjj@state.gov'\"})},\n",
       " {'p': (_430:Person {alias: \"'abedinh@state.gov'\"})},\n",
       " {'p': (_431:Person {alias: 'Huma Abed in'})},\n",
       " {'p': (_432:Person {alias: 'Pierce, Thomas JN'})},\n",
       " {'p': (_433:Person {alias: \"'cheryl.mills\"})},\n",
       " {'p': (_434:Person {alias: 'Dick Gephardt; Valmoro, Lona J<ValmoroLJ@state.gov>'})},\n",
       " {'p': (_435:Person {alias: 'Sullivan, Jacob J <Sullivann@state.gov>'})},\n",
       " {'p': (_436:Person {alias: 'Abedin, Huma <AbedinH@state.gov>; Sullivan, Jacob J <Sullivanil@state.gov>'})},\n",
       " {'p': (_437:Person {alias: \"'JilotyLC@state.gov'\"})},\n",
       " {'p': (_438:Person {alias: 'SES-O_Shift-I'})},\n",
       " {'p': (_439:Person {alias: 'Abedin, Huma <AbedinH@state.gov>; Sullivan, Jacob J <SullivanJJ@state.gov>'})},\n",
       " {'p': (_440:Person {alias: 'Kennedy, J Christian; Jones-Johnson, Carolyn D'})},\n",
       " {'p': (_441:Person {alias: 'Sullivan, Jacob J <Sullivanil@state.gov>'})},\n",
       " {'p': (_442:Person {alias: 'Sullivan, Jacob J<Sullivaral@state.gov>'})},\n",
       " {'p': (_443:Person {alias: 'Sullivan, Jacobi <SullivanJJ@state.gov>'})},\n",
       " {'p': (_444:Person {alias: 'SES-O_Shift-111'})},\n",
       " {'p': (_445:Person {alias: 'Sullivan, Jacob J <SullivanJJ@state.gov>'})},\n",
       " {'p': (_446:Person {alias: 'Sullivan, Jacobi <Sullivann@state.gov>'})},\n",
       " {'p': (_447:Person {alias: \"'ValmoroU@state.gov'; 'sullivanjj@state.gov'; Huma Abedin\"})},\n",
       " {'p': (_448:Person {alias: 'Sullivan, Jacob J'})},\n",
       " {'p': (_449:Person {alias: 'ValmoroU@state.gov <ValmoroU@state.gov>'})},\n",
       " {'p': (_450:Person {alias: 'Huma Abedin <AbedinH@state.gov>; Lissa Muscatine <muscatinel@state.gov>'})},\n",
       " {'p': (_451:Person {alias: \"'ValmoroU@state.gov'\"})},\n",
       " {'p': (_452:Person {alias: 'Jackson, Marjorie W; Ogden, Peter R'})},\n",
       " {'p': (_453:Person {alias: 'Lew, Jacob J <lewjj@state.gov>'})},\n",
       " {'p': (_454:Person {alias: 'Fedoroff, Nina V (STAS); Slaughter, Anne-Marie; Chollet, Derek H; Klevorick, Caitlin B; Smith, Jeannemarie E'})},\n",
       " {'p': (_455:Person {alias: 'Sullivan, Jacobi'})},\n",
       " {'p': (_456:Person {alias: \"'ValmoroU@state.gov'; Huma Abedin\"})},\n",
       " {'p': (_457:Person {alias: 'H; CDM'})},\n",
       " {'p': (_458:Person {alias: 'Sullivan, Jacob 1 <Sullivanil@state.gov>'})},\n",
       " {'p': (_459:Person {alias: 'LEIVE, CINDI'})},\n",
       " {'p': (_460:Person {alias: 'Jiloty, Lauren C <JilotyLC@state.gov>'})},\n",
       " {'p': (_461:Person {alias: 'Verma, Richard R; Rademacher, Paul R; Rodriguez, Miguel E; Hyde, Dana; Kennedy, Patrick F; Greene, Richard L'})},\n",
       " {'p': (_462:Person {alias: 'Limage, Simon G; Desaultes, Eric E'})},\n",
       " {'p': (_463:Person {alias: 'Abed in, Huma'})},\n",
       " {'p': (_464:Person {alias: 'psolisdoyle'})},\n",
       " {'p': (_465:Person {alias: 'Buhl, Cindy <Cindy.Buhl@mail.house.gov>'})},\n",
       " {'p': (_466:Person {alias: \"'toivnf@state.gov'\"})},\n",
       " {'p': (_467:Person {alias: \"'ValmoroU@state.govi <ValmoroU@state.gov>\"})},\n",
       " {'p': (_468:Person {alias: 'Rose, Frank A'})},\n",
       " {'p': (_469:Person {alias: 'Angela Goodchild'})},\n",
       " {'p': (_470:Person {alias: 'Reines, Philippe I'})},\n",
       " {'p': (_471:Person {alias: 'Fitzpatrick, Kathleen M'})},\n",
       " {'p': (_472:Person {alias: \"Huma Abedin; 'ValmoroU@state.gov'\"})},\n",
       " {'p': (_473:Person {alias: 'Anderson, Gerald C; Killion, David T; Feltman, Jeffrey D'})},\n",
       " {'p': (_474:Person {alias: \"'cheryl.mills 'sullivanjj@state.gov' B6\"})},\n",
       " {'p': (_475:Person {alias: 'Abedin, Huma <AbedinH@state.gov>; Sullivan, Jacob J <Sullivann@state.gov>'})},\n",
       " {'p': (_476:Person {alias: 'Abedin, Huma <AbedinH@state.gov>; Sullivan, Jacobi <SullivartIJ@state.gov>'})},\n",
       " {'p': (_477:Person {alias: \"'sullivanjj@state.gov.\"})},\n",
       " {'p': (_478:Person {alias: \"'sbwhoeop\"})},\n",
       " {'p': (_479:Person {alias: \"'cheryl.mills 'pvervee\"})},\n",
       " {'p': (_480:Person {alias: \"'cheryl.mills 'pverveet\"})},\n",
       " {'p': (_481:Person {alias: 'SES-0 Shift-II'})},\n",
       " {'p': (_482:Person {alias: 'Shortley, Timothy R; Burns, William J; Steinberg, James B'})},\n",
       " {'p': (_483:Person {alias: 'Abedin, Huma <AbedinH@state.gov>; Mills, Cheryl D <MillsCD@state.gov>'})},\n",
       " {'p': (_484:Person {alias: 'Berger, Samuel R.'})},\n",
       " {'p': (_485:Person {alias: \"'pverveer\"})},\n",
       " {'p': (_486:Person {alias: \"'millscd@state.gov'\"})},\n",
       " {'p': (_487:Person {alias: \"'mhcaleja@state.gov'; 'jonespw2@state.gov'\"})},\n",
       " {'p': (_488:Person {alias: 'Bando, Jun'})},\n",
       " {'p': (_489:Person {alias: \"'Fr Alex Karloutsos'\"})},\n",
       " {'p': (_490:Person {alias: 'Reines, Philippe I; McHale, Judith A; Crowley, Philip J'})},\n",
       " {'p': (_491:Person {alias: 'CDM'})},\n",
       " {'p': (_492:Person {alias: 'ImuscatinE'})},\n",
       " {'p': (_493:Person {alias: 'lmuscatine Sullivan, Jacob'})},\n",
       " {'p': (_494:Person {alias: 'EEB-A-MTAA-MTA-DL; Ryan, Ann M; Brown, Paul A (E); Bobo, Jack A'})},\n",
       " {'p': (_495:Person {alias: 'Rana, Gautam A; Scanlon, Amy B; Verma, Richard R; Feltman, Jeffrey D; Sanderson, Janet A; Schlicher, Ronald L;'})},\n",
       " {'p': (_496:Person {alias: 'Laszczych, Joanne; Toiv, Nora F; Lurie, Mike D'})},\n",
       " {'p': (_497:Person {alias: 'SES-O_SWO-Only'})},\n",
       " {'p': (_498:Person {alias: 'ValmoroU@state.govi <ValmoroU@state.gov>'})},\n",
       " {'p': (_499:Person {alias: \"'ValmoroLJ state.gov'; Huma Abed in\"})},\n",
       " {'p': (_500:Person {alias: \"'abedinh@state.gov'; 'ValmoroU@state.gov'\"})},\n",
       " {'p': (_501:Person {alias: 'Wells, Alice G; Rana, Gautam A; Verma, Richard R'})},\n",
       " {'p': (_502:Person {alias: 'Smith, Daniel B'})},\n",
       " {'p': (_503:Person {alias: 'Polt, Michael C; Turk, David M'})},\n",
       " {'p': (_504:Person {alias: 'PoIt, Michael C; Turk, David M; Sincavage, Justine M; Malin, Mary Catherine; Benda, Susan; Koh, Harold Hongju;'})},\n",
       " {'p': (_505:Person {alias: '\"vermarr@state.gov\" <vermarr@state.gov>, \"sullivanjj@state.gov\" <sullivanjj@state.gov>, lewj@state.gov'})},\n",
       " {'p': (_506:Person {alias: 'Reines, Philippe I <reinesp@state.gov>; Sullivan, Jacob J <Sullivanil@state.gov>; Abedin, Huma'})},\n",
       " {'p': (_507:Person {alias: 'Steinberg, James B; Sullivan, Jacob J; Macmanus, Joseph E'})},\n",
       " {'p': (_508:Person {alias: 'Toiv, Nora F; Verma, Richard R'})},\n",
       " {'p': (_509:Person {alias: 'Sullivan, Jacob J <Sullivan11@state.gov>'})},\n",
       " {'p': (_510:Person {alias: 'Abedin, Huma <AbedinH@state.gov>; Jiloty, Lauren C <JilotyLC@state.gov>'})},\n",
       " {'p': (_511:Person {alias: 'Beale, Courtney A Kramer; SES-O_Shift-1; SES-O_Shift-11'})},\n",
       " {'p': (_512:Person {alias: 'Macmanus, Joseph E; Mills, Cheryl D; Sullivan, Jacob J; S_SpecialAssistants'})},\n",
       " {'p': (_513:Person {alias: 'Sullivan, Jacob J <Sullivanii@state.gov>'})},\n",
       " {'p': (_514:Person {alias: 'SES-0'})},\n",
       " {'p': (_515:Person {alias: 'H; abedinh@state.gov <abedinh@state.gov>'})},\n",
       " {'p': (_516:Person {alias: 'Sullivan, Jacob J; Kaidanow, Tina S; Scanlon, Amy B; McEldowney, Nancy E'})},\n",
       " {'p': (_517:Person {alias: 'Sullivan, Jacob 1; Kaidanow, Tina 5; Scanlon, Amy B; McEldowney, Nancy E'})},\n",
       " {'p': (_518:Person {alias: 'Sullivan, Jacob J; Kaidanow, Tina 5; Scanlon, Amy B; McEldowney, Nancy E'})},\n",
       " {'p': (_519:Person {alias: 'ValmoroU@state.gov <ValmoroU@state.gov>; abedinh@state.gov <abedinh@state.gov>'})},\n",
       " {'p': (_520:Person {alias: 'Valmoro, Lona J <ValmoroU@state.gov>'})},\n",
       " {'p': (_521:Person {alias: 'HAbedin'})},\n",
       " {'p': (_522:Person {alias: 'McLean, Lori A; Coleman, Claire L; Lavy, Brendan L; Crocker, Bathsheba N'})},\n",
       " {'p': (_523:Person {alias: 'Jon Davidson'})},\n",
       " {'p': (_524:Person {alias: 'Abedin, Huma <AbedinH@state.gov>; Sullivan, Jacob J<SullivanJJ@state.gov>'})},\n",
       " {'p': (_525:Person {alias: \"'Verma, Richard'; Sullivan, Jacob J; Shapiro, Andrew J; Macmanus, Joseph E\"})},\n",
       " {'p': (_526:Person {alias: 'Sullivan, Jacob J; Toiv, Nora F'})},\n",
       " {'p': (_527:Person {alias: 'Faithdav6'})},\n",
       " {'p': (_528:Person {alias: 'Sullivan, Jacob J; Kennedy, Patrick F; Steinberg, James B'})},\n",
       " {'p': (_529:Person {alias: 'Bakshi, Amar; Blair, Oni K; Goldberger, Thomas H; Bass, Warren; Holmstrom, Todd C; Schlicher, Ronald L; Rudman,'})},\n",
       " {'p': (_530:Person {alias: 'Cheryl Millsl; Cheryl Mills; Abedin, Huma'})},\n",
       " {'p': (_531:Person {alias: 'Crocker, Bathsheba N; Deeks, Ashley S; Spector, Phillip M'})},\n",
       " {'p': (_532:Person {alias: 'Mills, Cheryl D; Abedin, Huma; Sullivan, Jacob J'})},\n",
       " {'p': (_533:Person {alias: 'Muscatine, Lissa; Davidow, Jeffrey S; Shannon, Thomas A; Kelly, Craig A'})},\n",
       " {'p': (_534:Person {alias: 'Huma Abedin; heather.samuelson'})},\n",
       " {'p': (_535:Person {alias: 'Laszczych Joanne<Laszczychi@state.gov>'})},\n",
       " {'p': (_536:Person {alias: 'Crocker, Bathsheba N'})},\n",
       " {'p': (_537:Person {alias: 'Mills, Cheryl D; cheryl.mills'})},\n",
       " {'p': (_538:Person {alias: 'Cheryl Millsl'})},\n",
       " {'p': (_539:Person {alias: 'Abedin, Huma; Sullivan, Jacob J'})},\n",
       " {'p': (_540:Person {alias: 'Sullivan, Jacob J; Verveer, Melanne S'})},\n",
       " {'p': (_541:Person {alias: 'Slaughter, Anne-Marie; Toiv, Nora F'})},\n",
       " {'p': (_542:Person {alias: 'Crowley, Philip 3'})},\n",
       " {'p': (_543:Person {alias: 'Toiv, Nora F; Peria, Laura'})},\n",
       " {'p': (_544:Person {alias: 'SSRAP_StaffAssistants; Pauli, Rosemarie; Dejban, Donna D'})},\n",
       " {'p': (_545:Person {alias: 'Posner, Michael H; Yamamoto, Donald Y; Lanier, Jerry P (Kampala); Bando, Jun'})},\n",
       " {'p': (_546:Person {alias: 'Toiv, Nora F; Pella, Laura'})},\n",
       " {'p': (_547:Person {alias: 'Pena, Laura'})},\n",
       " {'p': (_548:Person {alias: \"Abedin, Huma; 'Jake Sullivan'\"})},\n",
       " {'p': (_549:Person {alias: 'McLean, Lori A'})},\n",
       " {'p': (_550:Person {alias: \"'sullivanij@state.gov'\"})},\n",
       " {'p': (_551:Person {alias: 'Paul Farmer Jennie Block'})},\n",
       " {'p': (_552:Person {alias: 'williamsbarrett Minyon Moore'})},\n",
       " {'p': (_553:Person {alias: 'Bellegarde, Daniel P; Mills, Cheryl D; Sullivan, Jacob 1'})},\n",
       " {'p': (_554:Person {alias: 'Bellegarde, Daniel P; Mills, Cheryl D; Sullivan, Jacob'})},\n",
       " {'p': (_555:Person {alias: 'Doug Band; Justin Cooper'})},\n",
       " {'p': (_556:Person {alias: 'Sullivan, Jacob 3; Mills, Cheryl D'})},\n",
       " {'p': (_557:Person {alias: 'SES-O_Shift-II'})},\n",
       " {'p': (_558:Person {alias: 'laszczychj@state.gov; ToivNF@state.gov'})},\n",
       " {'p': (_559:Person {alias: 'Abedin, Huma; H'})},\n",
       " {'p': (_560:Person {alias: 'Cheryl Mills <millscd@state.gov>; Cheryl Mills'})},\n",
       " {'p': (_561:Person {alias: '<jIlichtmar ; Cheryl Mills]'})},\n",
       " {'p': (_562:Person {alias: 'Sullivan, Jacob 3; McHale, Judith A; Crowley, Philip 3'})},\n",
       " {'p': (_563:Person {alias: 'Sullivan, Jacob 3; McHale, Judith A; Crowley, Philip J; Toiv, Nora F'})},\n",
       " {'p': (_564:Person {alias: 'Sullivan, Jacob); McHale, Judith A; Crowley, Philip J; Toiv, Nora F'})},\n",
       " {'p': (_565:Person {alias: 'Pierce, Thomas 3N'})},\n",
       " {'p': (_566:Person {alias: 'H; Abedin, Huma'})},\n",
       " {'p': (_567:Person {alias: 'Wood, Robert A (PACE)'})},\n",
       " {'p': (_568:Person {alias: 'hdr22@clintonemail.com ; Abedin, Huma'})},\n",
       " {'p': (_569:Person {alias: 'Greene, Richard L; Shah, Khushali P; Hoyle, Peggy A; Warren, Wade'})},\n",
       " {'p': (_570:Person {alias: \"'bnolan\"})},\n",
       " {'p': (_571:Person {alias: 'Abedin, Huma; Sullivan, Jacob 1'})},\n",
       " {'p': (_572:Person {alias: 'cheryl.mill.'})},\n",
       " {'p': (_573:Person {alias: 'Sullivan, Jacob 3; Chollet, Derek H; Muscatine, Lissa'})},\n",
       " {'p': (_574:Person {alias: 'Crowley, Philip J; Hammer, Michael A; Byrnes, Robert S; Pittman, Susan R (INL); Sullivan, John C (INL/PC); McGlynn,'})},\n",
       " {'p': (_575:Person {alias: 'SES_DutyDeputies; SES-O_SWO-Only; Lan, Melissa'})},\n",
       " {'p': (_576:Person {alias: 'Muscatine, Lissa; Tillemann, Tomicah S; Sullivan, Jacob 3'})},\n",
       " {'p': (_577:Person {alias: 'McLean, Lori A; Mills, Cheryl D; S_SpecialAssistants; Coleman, Claire L; Rana, Gautam A; West, Thomas; Smith,'})},\n",
       " {'p': (_578:Person {alias: 'Dick Gephardt; Valmoro, Lona J <ValmoroLl@state.gov>'})},\n",
       " {'p': (_579:Person {alias: 'Cheryl Mills'})},\n",
       " {'p': (_580:Person {alias: 'Lew, Jacob 3'})},\n",
       " {'p': (_581:Person {alias: 'Abedin, Hume'})},\n",
       " {'p': (_582:Person {alias: 'Sullivan, Jacob 1'})},\n",
       " {'p': (_583:Person {alias: 'Carpenter, Margaret V.W.; Mills, Cheryl D'})},\n",
       " {'p': (_584:Person {alias: 'Donoghue, Joan E; Deeks, Ashley S; Mathias, Stephen; Prosser, Sarah E; Kelly, Ian C (PACE)'})},\n",
       " {'p': (_585:Person {alias: 'Toiv, Nora F; alec.ross'})},\n",
       " {'p': (_586:Person {alias: 'S_SpecialAssistants; Macmanus, Joseph E'})},\n",
       " {'p': (_587:Person {alias: 'Abechn, Huma'})},\n",
       " {'p': (_588:Person {alias: 'Park, Pamela P; Tesoner Mark; Davies, Glyn T; Arvizu, Alex A; Kim, Sung Y; Kim, Yuri 3; Richardson, Eric N; Ohtagaki,'})},\n",
       " {'p': (_589:Person {alias: 'SES-O_Shift-11'})},\n",
       " {'p': (_590:Person {alias: 'SES-O_Shift-III'})},\n",
       " {'p': (_591:Person {alias: 'abedinh@state.gov'})},\n",
       " {'p': (_592:Person {alias: \"ToivNF@state.gov <ToivNF@state.gov>; 'Mills, Cheryl D' <MillsCD@state.gov>; Cheryl Millsl\"})},\n",
       " {'p': (_593:Person {alias: 'Toiv, Nora F; Mills, Cheryl D; Cheryl Mills1'})},\n",
       " {'p': (_594:Person {alias: 'Perla, Laura; Carpenter, Margaret V.W.'})},\n",
       " {'p': (_595:Person {alias: 'Samuelson, Heather F; Pena, Laura'})},\n",
       " {'p': (_596:Person {alias: 'Adler, Caroline E (Special Use Only)'})},\n",
       " {'p': (_597:Person {alias: 'Thessin, James H; Conklin, Maegan L; Spector, Phillip M'})},\n",
       " {'p': (_598:Person {alias: 'Abedin, Huma; Mills, Cheryl D'})},\n",
       " {'p': (_599:Person {alias: 'Kennedy, J Christian;'})},\n",
       " {'p': (_600:Person {alias: 'Kennedy, J Christian; Jones-Johnson, Carolyn D;'})},\n",
       " {'p': (_601:Person {alias: 'SES-0; SES-O_Shift-I'})},\n",
       " {'p': (_602:Person {alias: 'Dinger, John R'})},\n",
       " {'p': (_603:Person {alias: 'Lu, Christopher P. _ Smith, Elizabeth S.'})},\n",
       " {'p': (_604:Person {alias: 'SES-0 Shift-I'})},\n",
       " {'p': (_605:Person {alias: 'SES-O_Shift-1'})},\n",
       " {'p': (_606:Person {alias: 'Webster, Christopher W; Amselem, W Lewis; Benning, Douglass R;'})},\n",
       " {'p': (_607:Person {alias: 'Sullivan, Jacob 3'})},\n",
       " {'p': (_608:Person {alias: 'Moncrief, Benjamin (LeMieux) <Benjamin_Moncrief@LeMieux.senate.gov>'})},\n",
       " {'p': (_609:Person {alias: 'cheryl.mills'})},\n",
       " {'p': (_610:Person {alias: 'West, Thomas; Mills, Cheryl D'})},\n",
       " {'p': (_611:Person {alias: 'Posner, Michael H; Patel, Mira D; Baer, Daniel B; Hyde, Dana; Goosby, Eric; Smith, Daniel B; Moy, Kin W'})},\n",
       " {'p': (_612:Person {alias: 'Wells, Alice G; Blake, Robert 0; Smith, Daniel B'})},\n",
       " {'p': (_613:Person {alias: 'Caroline.Adler Mills, Cheryl D;'})},\n",
       " {'p': (_614:Person {alias: 'Patel, Shraddha; Samuelson, Heather F'})},\n",
       " {'p': (_615:Person {alias: 'Russell, Daniel A; Thomas, Harry K (Director General); Mills, Cheryl D'})},\n",
       " {'p': (_616:Person {alias: 'Verma, Richard R; Rodriguez, Miguel E'})},\n",
       " {'p': (_617:Person {alias: 'SES-0 Shift-III'})},\n",
       " {'p': (_618:Person {alias: 'SES-O_SWO-Only; SES-O_Shift-11; SES-O_Shift-l; Bitter, Rena; Sullivan, Stephanie S'})},\n",
       " {'p': (_619:Person {alias: 'Koh, Harold Hongju <KohHH@state.gov>'})},\n",
       " {'p': (_620:Person {alias: 'Cheryl Millsl ; Mills, Cheryl D'})},\n",
       " {'p': (_621:Person {alias: '- Abedin, Huma'})},\n",
       " {'p': (_622:Person {alias: 'Robinson, David M; Morales Jr, Hector E; Webster, Christopher W'})},\n",
       " {'p': (_623:Person {alias: 'Culver, Chris D; Arola, Heidi R; Kubiske, Lisa; Loh, Anthony X; Kelly, Craig A; McMullen, Christopher J;'})},\n",
       " {'p': (_624:Person {alias: \"'Russorv@state.gov'; Huma Abedin\"})},\n",
       " {'p': (_625:Person {alias: 'Campbell, Piper; Singh, Vikram I; McKean, Margaret B; Keays, Michael C; Misko, Sean A; Simon, Jessica L; Bommer,'})},\n",
       " {'p': (_626:Person {alias: 'NEWS-SCA; NEWS-CA; NEWS-SCT; NEWS-Pakistan'})},\n",
       " {'p': (_627:Person {alias: 'Crowley, Philip J <CrowleyP.1@state.gov>; preines@'})},\n",
       " {'p': (_628:Person {alias: 'To iv, Nora F'})},\n",
       " {'p': (_629:Person {alias: \"'Abedin, Huma'; millscd@state.gov\"})},\n",
       " {'p': (_630:Person {alias: \"'Abedin, Huma' <AbedinH@state.gov>; millscd@state.gov <millscd@state.gov>\"})},\n",
       " {'p': (_631:Person {alias: \"'oterom3\"})},\n",
       " {'p': (_632:Person {alias: 'Balderston, Kris M'})},\n",
       " {'p': (_633:Person {alias: 'Mills, Cheryl D <MillsCD@state.gov>; Abedin, Huma <AbedinH@state.gov>; Sullivan, Jacob J <Sullivann@state.gov>'})},\n",
       " {'p': (_634:Person {alias: 'Mills, Cheryl D <MillsCD@state.gov>; Abedin, Huma <AbedinH@state.gov>; Sullivan, Jacob J<Sullivanil@state.gov>'})},\n",
       " {'p': (_635:Person {alias: 'Toiv, Nora F; Laszczych, Joanne'})},\n",
       " {'p': (_636:Person {alias: 'Valmoro, Lona J'})},\n",
       " {'p': (_637:Person {alias: 'Abedin, Huma; Sullivan, Jacob 1; Connelly, Maura 1.4(B)'})},\n",
       " {'p': (_638:Person {alias: 'Sullivan, Jacob J <SullivanJJ@state.gov>; Reines, Philippe I <reinesp@state.gov>; Abedin, Huma'})},\n",
       " {'p': (_639:Person {alias: \"'cheryl.mills@ 'SteinbergJB@state.gov'\"})},\n",
       " {'p': (_640:Person {alias: 'Sullivan, Jacob .1; Abedin, Huma'})},\n",
       " {'p': (_641:Person {alias: 'Abedin, Huma; Sullivan, Jacob'})},\n",
       " {'p': (_642:Person {alias: \"'Nora Toiv'\"})},\n",
       " {'p': (_643:Person {alias: 'Mills, Cheryl D; Toiv, Nora F'})},\n",
       " {'p': (_644:Person {alias: 'Plowden, Marisa L'})},\n",
       " {'p': (_645:Person {alias: 'Huma Abedin; Lissa Muscatine'})},\n",
       " {'p': (_646:Person {alias: 'Cheryl.mills('})},\n",
       " {'p': (_647:Person {alias: 'cheryl.mills B6'})},\n",
       " {'p': (_648:Person {alias: 'SWO'})},\n",
       " {'p': (_649:Person {alias: 'H; CDM; Huma Abedin'})},\n",
       " {'p': (_650:Person {alias: 'SES_DutyDeputies; SES-O_SWO-Only; Bernier-Toth, Michelle'})},\n",
       " {'p': (_651:Person {alias: 'SES_DutyDeputies; SES-O_SWO-Only; EAP-FO-Office-DL'})},\n",
       " {'p': (_652:Person {alias: 'SES_DutyDeputies; 5ES-0.'})},\n",
       " {'p': (_653:Person {alias: 'SES-O_SWO-Only; SES_PutyDeputies'})},\n",
       " {'p': (_654:Person {alias: 'Jiloty, Lauren C'})},\n",
       " {'p': (_655:Person {alias: 'H2 <hr15@att.blackberry.net>'})},\n",
       " {'p': (_656:Person {alias: 'Laszczych, Joanne; Toiv, Nora F; Lukens, Lewis A; Carson, Johnnie'})},\n",
       " {'p': (_657:Person {alias: 'Cheryl Mills; Jake Sullivan'})},\n",
       " {'p': (_658:Person {alias: 'SES-OShift-11'})},\n",
       " {'p': (_659:Person {alias: 'abedinh@state.gov; preines'})},\n",
       " {'p': (_660:Person {alias: 'preines pverveer'})},\n",
       " {'p': (_661:Person {alias: 'Crowley, Philip J'})},\n",
       " {'p': (_662:Person {alias: 'Rudman, Mara; Sullivan, Jacob 3; Prince, Jonathan M (PACE)'})},\n",
       " {'p': (_663:Person {alias: \"'ValmoroU@state.gov' <ValmoroU@state.gov>\"})},\n",
       " {'p': (_664:Person {alias: 'Anderson, Gerald C'})},\n",
       " {'p': (_665:Person {alias: 'NEWS-Mahogany; NEWS-Sudan'})},\n",
       " {'p': (_666:Person {alias: 'Lissa Muscatine'})},\n",
       " {'p': (_667:Person {alias: 'Verveer, Melanne S'})},\n",
       " {'p': (_668:Person {alias: 'cheryl.mills pverveer'})},\n",
       " {'p': (_669:Person {alias: \"CDM; 'pvervee\"})},\n",
       " {'p': (_670:Person {alias: 'Nose, Frank A'})},\n",
       " {'p': (_671:Person {alias: 'Angela Goodchild; Henriette Kolb'})},\n",
       " {'p': (_672:Person {alias: \"'cheryl.mill cheryl.mills 'pvervee\"})},\n",
       " {'p': (_673:Person {alias: 'Feltman, Jeffrey D .'})},\n",
       " {'p': (_674:Person {alias: 'Banks, Dana; Morgan, Jack A'})},\n",
       " {'p': (_675:Person {alias: 'Verveer, Melanne S;'})},\n",
       " {'p': (_676:Person {alias: 'PJ'})},\n",
       " {'p': (_677:Person {alias: 'Feldman, Daniel F; Arzt, JoAnne; Mills, Cheryl D; McPartland, Suzanne'})},\n",
       " {'p': (_678:Person {alias: 'S_SpecialAssistants; Sullivan, Jacob J; Mills, Cheryl D; Macmanus, Joseph E'})},\n",
       " {'p': (_679:Person {alias: 'Smitham, Thomas D; Nelson, David D'})},\n",
       " {'p': (_680:Person {alias: 'Plowden, Marisa L; Lurie, Mike D; Toiv, Nora F; Laszczych, Joanne'})},\n",
       " {'p': (_681:Person {alias: 'Reines, Philippe I; McHale, Judith A; Crowley, Philip 3'})},\n",
       " {'p': (_682:Person {alias: 'Posner, Michael H; Mills, Cheryl D; Yamamoto, Donald Y; Bando, Jun; Leonard, Mary Beth; Fitzgerald, William E; Lew,'})},\n",
       " {'p': (_683:Person {alias: 'NEWS-Mahogany; NEWS-H; Task Force Honduras; NEWS-WHA'})},\n",
       " {'p': (_684:Person {alias: 'Polt, Michael C; Donovan, Patrick D'})},\n",
       " {'p': (_685:Person {alias: 'Laszczych, Joanne<Laszczych.l@state.gov>'})},\n",
       " {'p': (_686:Person {alias: 'Laszczych, Joanne<LaszczychJ@state.gov>'})},\n",
       " {'p': (_687:Person {alias: 'Campbell, Piper A'})},\n",
       " {'p': (_688:Person {alias: 'Lew, Jacob 3; Verma, Richard R; Polt, Michael C; Kennedy, Patrick F; Boswell, Eric 3; Wood, Robert A (PACE);'})},\n",
       " {'p': (_689:Person {alias: 'Samuelson, Heather F'})},\n",
       " {'p': (_690:Person {alias: 'SES-O_Shift-I; SES-O_Shift-II'})},\n",
       " {'p': (_691:Person {alias: 'Laszczych, Joanne; Toiv, Nora F'})},\n",
       " {'p': (_692:Person {alias: 'psolisdoylE'})},\n",
       " {'p': (_693:Person {alias: 'Cheryl D; Sullivan, Jacob'})},\n",
       " {'p': (_694:Person {alias: 'Mills, Cheryl D; Sullivan, Jacob i'})},\n",
       " {'p': (_695:Person {alias: 'Macmanus, Joseph E; Sullivan, Jacob J; Anderson, Gerald C; Cook, Nerissa'})},\n",
       " {'p': (_696:Person {alias: 'Toiv, Nora F; Samuelson, Heather F'})},\n",
       " {'p': (_697:Person {alias: 'millscd@state.gov'})},\n",
       " {'p': (_698:Person {alias: 'Sullivan, Jacob J; capriciamarshall'})},\n",
       " {'p': (_699:Person {alias: 'Polt, Michael C; Turk, David M; Sincavage, Justine M; Malin, Mary Catherine; Benda, Susan; Koh, Harold Hongju;'})},\n",
       " {'p': (_700:Person {alias: 'SES-O_Shift-II; Bennett, Virginia L'})},\n",
       " {'p': (_701:Person {alias: 'SES-QShift-I'})},\n",
       " {'p': (_702:Person {alias: 'Narain, Paul F'})},\n",
       " {'p': (_703:Person {alias: 'Campbell, Piper; Wells, Alice G'})},\n",
       " {'p': (_704:Person {alias: 'Henshaw, Simon'})},\n",
       " {'p': (_705:Person {alias: 'Ross, Alec 1'})},\n",
       " {'p': (_706:Person {alias: 'SWO; Bitter, Rena; Sullivan, Stephanie S; SES-O_Shift-II'})},\n",
       " {'p': (_707:Person {alias: 'Enav, Cari R; Ostermeier, Amy A'})},\n",
       " {'p': (_708:Person {alias: 'Townley, Stephen G'})},\n",
       " {'p': (_709:Person {alias: 'H; Laszczych, Joanne'})},\n",
       " {'p': (_710:Person {alias: 'Holbrooke, Richard C; Steinberg, James B; Lew, Jacob J; Burns, William J; Blake, Robert 0; Shapiro, Andrew J; Mills,'})},\n",
       " {'p': (_711:Person {alias: 'Smith, Daniel B; Macmanus, Joseph E'})},\n",
       " {'p': (_712:Person {alias: 'Sullivan, Jacob 3; Kaidanow, Tina S; Scanlon, Amy B; McEldowney, Nancy E'})},\n",
       " {'p': (_713:Person {alias: 'Verveer, Melanne S; Abedin, Huma'})},\n",
       " {'p': (_714:Person {alias: 'Verveer, Melanne 5; Abedin, Huma'})},\n",
       " {'p': (_715:Person {alias: 'Verma, Richard R'})},\n",
       " {'p': (_716:Person {alias: 'CDM; Huma Abedin'})},\n",
       " {'p': (_717:Person {alias: 'Meier, Edward F'})},\n",
       " {'p': (_718:Person {alias: 'jonrdavidson'})},\n",
       " {'p': (_719:Person {alias: 'Blayne Allard, Alice A'})},\n",
       " {'p': (_720:Person {alias: 'Doug Band'})},\n",
       " {'p': (_721:Person {alias: 'CDM; Jake Sullivan; Huma Abedin'})},\n",
       " {'p': (_722:Person {alias: 'Lewis, Jessica (Reid)'})},\n",
       " {'p': (_723:Person {alias: 'Imuscatine _ Sullivan, Jacob J'})},\n",
       " {'p': (_724:Person {alias: 'Imuscatine Sullivan, Jacob J'})},\n",
       " {'p': (_725:Person {alias: 'Aguilera, Patricia'})},\n",
       " {'p': (_726:Person {alias: 'CDM; Huma Abedin; Jake Sullivan'})},\n",
       " {'p': (_727:Person {alias: 'Reines, Philippe I; Sullivan, Jacob J; Abedin, Huma'})},\n",
       " {'p': (_728:Person {alias: 'NEWS-WHA; SES-Line_UNGA; M_SpecialAssistants; SES-O_SWO-Only'})},\n",
       " {'p': (_729:Person {alias: 'MillsCD@state.gov'})},\n",
       " {'p': (_730:Person {alias: 'Sullivan, Jacob J; Abedin, Huma; SES_DutyDeputies; S_SpecialAssistants'})},\n",
       " {'p': (_731:Person {alias: 'Steinberg, James B; Sullivan, Jacob 3; Macmanus, Joseph E'})},\n",
       " {'p': (_732:Person {alias: \"'gordonph@state.gov' <gordonph@state.gov>; 'DaalderlH@state.gov' <DaalderIH@state.gov>; 'sullivanjj@state.gov'\"})},\n",
       " {'p': (_733:Person {alias: 'SES-O_Shift-II; SES-O_Shift-III; SWO; Bitter, Rena; Sullivan, Stephanie S'})},\n",
       " {'p': (_734:Person {alias: 'Lindsey, Bruce; Mills, Cheryl D'})},\n",
       " {'p': (_735:Person {alias: 'MilIsCD@state.gov'})},\n",
       " {'p': (_736:Person {alias: 'Valenzuela, Arturo A; B6'})},\n",
       " {'p': (_737:Person {alias: 'Sullivan, Jacob 3; Verma, Richard R; Turk, David M'})},\n",
       " {'p': (_738:Person {alias: 'abedinh@state.gov; ValmoroU@state.gov'})},\n",
       " {'p': (_739:Person {alias: 'H; abedinh@state.gov'})},\n",
       " {'p': (_740:Person {alias: 'SES-O_Shift-Ill'})},\n",
       " {'p': (_741:Person {alias: 'Carpenter, Margaret V.W'})},\n",
       " {'p': (_742:Person {alias: 'Verveer, Melanne S; Bando, Jun; Cook, Akunna E; Yamamoto, Donald Y; Pasi, Geeta'})},\n",
       " {'p': (_743:Person {alias: 'Buhl, Cindy <Cindy.BuhlOmail.house.gov>'})},\n",
       " {'p': (_744:Person {alias: 'Anne Lyons; Colby Cooper'})},\n",
       " {'p': (_745:Person {alias: 'Mills, Cheryl D; Yamamoto, Donald Y; Cook, Akunna E; Pasi, Geeta'})},\n",
       " {'p': (_746:Person {alias: 'Diane Reynolds'})},\n",
       " {'p': (_747:Person {alias: 'MacDonald, Andrew T'})},\n",
       " {'p': (_748:Person {alias: 'Abedin, Huma; Jiloty, Lauren C'})},\n",
       " {'p': (_749:Person {alias: 'Reynoso, Julissa; Kelly, Craig A; Valenzuela, Arturo A; Gonzalez, Juan S'})},\n",
       " {'p': (_750:Person {alias: 'Yamamoto, Donald Y; Posner, Michael H; Sullivan, Jacob J; Cook, Akunna E'})},\n",
       " {'p': (_751:Person {alias: 'Baer, Daniel B'})},\n",
       " {'p': (_752:Person {alias: 'muscatinel@state.gov; Valmoroll@state.gov; Huma Abedin'})},\n",
       " {'p': (_753:Person {alias: 'muscatinel@state.gov; VaImoroU@state.gov; Huma Abedin'})},\n",
       " {'p': (_754:Person {alias: 'Brown, Paul A (E); Sierawski, Clare X; Kastenberg, Rachel L (OES); Nelson, Drew S (OES)'})},\n",
       " {'p': (_755:Person {alias: 'Sullivan, Jacob J; Muscatine, Lissa'})},\n",
       " {'p': (_756:Person {alias: 'Valmoro, Lona J; Huma A edin'})},\n",
       " {'p': (_757:Person {alias: 'Mills, Cheryl D; Sullivan, Jacob J; Abedin, Huma; Muscatine, Lissa'})},\n",
       " {'p': (_758:Person {alias: 'Campbell, Piper; Crocker, Bathsheba N'})},\n",
       " {'p': (_759:Person {alias: \"'Carpenter, Margaret V.W.\"})},\n",
       " {'p': (_760:Person {alias: 'Sullivan, Jacob 3; Abedin, Huma'})},\n",
       " {'p': (_761:Person {alias: 'Abedin, Huma; Valmoro, Lona J'})},\n",
       " {'p': (_762:Person {alias: 'McHale, Judith A; Crowley, Philip J'})},\n",
       " {'p': (_763:Person {alias: 'Adams, David S; Rodriguez, Miguel E'})},\n",
       " {'p': (_764:Person {alias: 'Dowd, Katie W; Balderston, Kris M'})},\n",
       " {'p': (_765:Person {alias: 'Stremlau, Matthew H; Plowden, Marisa L; Klevorick, Caitlin B; Toiv, Nora F'})},\n",
       " {'p': (_766:Person {alias: 'Holbrooke, Richard; Nasr, S Vali R'})},\n",
       " {'p': (_767:Person {alias: 'SES-O_SWO-Only; Adler, Clay K; White, Terry J'})},\n",
       " {'p': (_768:Person {alias: 'Blake, Stephen J (EAP/MLS); Tesone, Mark'})},\n",
       " {'p': (_769:Person {alias: \"'sbwhoeop <sbwhoeor\"})},\n",
       " {'p': (_770:Person {alias: 'Sullivan, Jacob J; McEldowney, Nancy E; Boyer, Spencer P'})},\n",
       " {'p': (_771:Person {alias: 'ValmoroU@state.gov'})},\n",
       " {'p': (_772:Person {alias: 'Jacobs, Janice L; Feltman, Jeffrey D; Macmanus, Joseph E; Fogarty, Daniel 3'})},\n",
       " {'p': (_773:Person {alias: 'Smith, Daniel B; Sullivan, Jacob 3; Verma, Richard R; Mills, Cheryl D; Lew, Jacob J; Koh, Harold Hongju; Steinberg,'})},\n",
       " {'p': (_774:Person {alias: 'Hume, Cameron; Marciel, Scot A'})},\n",
       " {'p': (_775:Person {alias: 'Lindwall, David E'})},\n",
       " {'p': (_776:Person {alias: 'Breese, Terry A'})},\n",
       " {'p': (_777:Person {alias: 'Nossel, Suzanne F; Cassidy, Joseph P; Cleveland, Sarah H'})},\n",
       " {'p': (_778:Person {alias: 'Merten, Kenneth H; Kennedy, Patrick F; Trivelli, Paul A AMB USSOUTHCOM/SC-CC (L)'})},\n",
       " {'p': (_779:Person {alias: 'Beale, Courtney A Kramer; SES-O_Shift-I; SES-O_Shift-II'})},\n",
       " {'p': (_780:Person {alias: \"Mills, Cheryl D; 'cheryl.mills\"})},\n",
       " {'p': (_781:Person {alias: 'Mills, Cheryl D; icheryl.mills1'})},\n",
       " {'p': (_782:Person {alias: 'Goshko, Matt E; Mayhew, Sarah-Jane; Kaiser, Sandra L; Palmer, Christopher G'})},\n",
       " {'p': (_783:Person {alias: 'Bagley, Elizabeth F; Abedin, Huma'})},\n",
       " {'p': (_784:Person {alias: 'Sullivan, Jacob J; Macmanus, Joseph E; Littlejohn, J.R.; Wells, Alice G; Ashraf, Madeeha S; Crocker, Bathsheba N;'})},\n",
       " {'p': (_785:Person {alias: 'Beverley.Tempest'})},\n",
       " {'p': (_786:Person {alias: 'christinefalvo'})},\n",
       " {'p': (_787:Person {alias: 'Stanton, Katie'})},\n",
       " {'p': (_788:Person {alias: 'Valmoro, Lona J; Huma Abedin'})},\n",
       " {'p': (_789:Person {alias: 'Toiv, Nora F; Laszczych, Joanne; Diminuco, Steven L'})},\n",
       " {'p': (_790:Person {alias: 'icheryl.mills'})},\n",
       " {'p': (_791:Person {alias: 'Kennedy, Patrick F; Browning, Steve A'})},\n",
       " {'p': (_792:Person {alias: 'Smith, Daniel B; Kirby, Michael D'})},\n",
       " {'p': (_793:Person {alias: 'Thompson, Hillary C'})},\n",
       " {'p': (_794:Person {alias: 'SES-O_SWO-Only; SES-O_Shift-II; SES-O_Shift-I; Bitter, Rena; Sullivan, Stephanie S'})},\n",
       " {'p': (_795:Person {alias: 'SES-O_SWO-Only; SES-O_Shift-11; SES-O_Shift-1; Bitter, Rena; Sullivan, Stephanie S'})},\n",
       " {'p': (_796:Person {alias: 'Kirby, Michael D; Smith, Daniel B'})},\n",
       " {'p': (_797:Person {alias: 'Golden, Jennifer R'})},\n",
       " {'p': (_798:Person {alias: 'Gordon, Philip H; Sullivan, Jacob J; Limage, Simon G'})},\n",
       " {'p': (_799:Person {alias: 'Huma Abedin <AbedinH@state.gov>'})},\n",
       " {'p': (_800:Person {alias: 'SES-O_SWO-Only; SES-O_Shift-I; SES-O_Shift-II'})},\n",
       " {'p': (_801:Person {alias: 'Banks, Dana'})},\n",
       " {'p': (_802:Person {alias: 'Lalisa Froeder Dittrich; Stella Freitas Chamarelli; Juliana Paes De Castro; Laila Kesya Tavares De Lima'})},\n",
       " {'p': (_803:Person {alias: 'Campbell, Piper; Singh, Vikram J; McKean, Margaret B; Keays, Michael C; Misko, Sean A; Simon, Jessica L; Bommer,'})},\n",
       " {'p': (_804:Person {alias: \"'Russorv@state.gov'\"})},\n",
       " {'p': (_805:Person {alias: 'Campbell, Piper; Singh, Vikram 3; McKean, Margaret B; Keays, Michael C; Misko, Sean A; Simon, Jessica L; Bommer,'})},\n",
       " {'p': (_806:Person {alias: 'NEWS-SCA; NEWS-CA; NEWS-SC; NEWS-Pakistan'})},\n",
       " {'p': (_807:Person {alias: 'Wayne, E Anthony; Mills, Cheryl D'})},\n",
       " {'p': (_808:Person {alias: 'preines Schwerin, Daniel B'})},\n",
       " {'p': (_809:Person {alias: 'Ross, Alec J; DiMartino, Kitty; Chitre, Nanda S; Toiv, Nora F'})},\n",
       " {'p': (_810:Person {alias: 'Mills, Cheryl D <MillsCD@state.gov>; Sullivan, Jacob J <SullivanJJ@state.gov>'})},\n",
       " {'p': (_811:Person {alias: 'Sullivan, Jacob J; Reines, Philippe I; Abedin, Huma'})},\n",
       " {'p': (_812:Person {alias: \"Sullivan, Jacob.' <SullivanJJ@state.gov>, Reines, Philippe I <reinesp@state.gov>; Abedin, Huma\"})},\n",
       " {'p': (_813:Person {alias: 'Muscatine, Lissa; S_SpecialAssistants'})},\n",
       " {'p': (_814:Person {alias: 'Ensher, Henry S; Campbell, Piper'})},\n",
       " {'p': (_815:Person {alias: 'Sullivan, Jacobi <Sullivanii@state.gov>'})},\n",
       " {'p': (_816:Person {alias: 'Torres, Susan; Johnson, Clifton M'})},\n",
       " {'p': (_817:Person {alias: \"'Cheryl Mills'\"})},\n",
       " {'p': (_818:Person {alias: 'Jacobson, Roberta S'})},\n",
       " {'p': (_819:Person {alias: 'McMullen, Christopher J; Jacobson, Roberta S; Reynoso, Julissa; Gonzalez, Juan S'})},\n",
       " {'p': (_820:Person {alias: 'DiMartino, Kitty; Mills, Cheryl D'})},\n",
       " {'p': (_821:Person {alias: 'Feltman, Jeffrey D; Abedin, Huma; Sullivan, Jacob J; Mills, Cheryl D; Reines, Philippe I;'})},\n",
       " {'p': (_822:Person {alias: 'Merten, Kenneth H; Mills, Cheryl D; Kennedy, Patrick F'})},\n",
       " {'p': (_823:Person {alias: 'preines Sullivan, Jacob J'})},\n",
       " {'p': (_824:Person {alias: 'Merten, Kenneth H; Kennedy, Patrick F'})},\n",
       " {'p': (_825:Person {alias: 'Lindwall, David E; Merten, Kenneth H; Kennedy, Patrick F; Jacobs, Janice L; Lew, Jacob 3; Mills, Cheryl D'})},\n",
       " {'p': (_826:Person {alias: 'Mills, Cheryl D; Hormats, Robert D'})},\n",
       " {'p': (_827:Person {alias: 'Huma Abedin; Toiv, Nora F'})},\n",
       " {'p': (_828:Person {alias: 'Cooper, Kurtis A; Pelofsky, Eric J'})},\n",
       " {'p': (_829:Person {alias: 'Reines, Philippe I; Mills, Cheryl D'})},\n",
       " {'p': (_830:Person {alias: 'Sreebny, Daniel'})},\n",
       " {'p': (_831:Person {alias: 'MillsCD@state.gov; Sullivanil@state.gov'})},\n",
       " {'p': (_832:Person {alias: 'McMullen, Christopher 1; De Pirro, Velia M'})},\n",
       " {'p': (_833:Person {alias: 'MillsCD@state.gov <MillsCD@state.gov>; Sullivann@state.gov <SullivanJJ@state.gov>'})},\n",
       " {'p': (_834:Person {alias: 'MillsCD@state.gov <MillsCD@state.gov>; SullivanJJ@state.gov <SullivanJJ@state.gov>'})},\n",
       " {'p': (_835:Person {alias: 'Schwartz, Larry; Gill, Muazzam; Wade, Joseph W (Peshawar)'})},\n",
       " {'p': (_836:Person {alias: 'McMullen, Christopher J; De Pirro, Velia M'})},\n",
       " {'p': (_837:Person {alias: 'MillsCD@state.gov <MillsCD@state.gov>; Sullivanii@state.gov <Sullivanii@state.gov>'})},\n",
       " {'p': (_838:Person {alias: 'MillsCD@state.gov <MillsCD@state.gov>; SullivanJJ@state.gov <Sullivanil@state.gov>'})},\n",
       " {'p': (_839:Person {alias: 'MillsCD@state.gov <MillsCD@state.gov>; SullivanJJ@state.gov <Sullivann@state.gov>'})},\n",
       " {'p': (_840:Person {alias: 'MillsCD@state.gov <MillsCD@state.gov>; SullivanJJ@state.gov <Sullivan.1.1@state.gov>'})},\n",
       " {'p': (_841:Person {alias: 'Klevorick, Caitlin B'})},\n",
       " {'p': (_842:Person {alias: 'Kennedy, Patrick F; Lew, Jacob J; Jacobs, Janice L'})},\n",
       " {'p': (_843:Person {alias: 'MillsCD@state.gov <MillsCD@state.gov>; Sullivanil@state.gov <SullivanJJ@state.gov>'})},\n",
       " {'p': (_844:Person {alias: 'DiMartino, Kitty; Douglas, Walter T; Perez, Lea; Singh, Vikram J; Crowley, Philip J; Breeden, Philip X; LeBaron,'})},\n",
       " {'p': (_845:Person {alias: 'Coley, Theodore R; Bernier-Toth, Michelle'})},\n",
       " {'p': (_846:Person {alias: 'Huma Abedin <'})},\n",
       " {'p': (_847:Person {alias: 'SES-O_Shift-III; SES-O_Shift-I'})},\n",
       " {'p': (_848:Person {alias: 'Mills, Cheryl D; Abedin, Huma; Sullivan, Jacob.)'})},\n",
       " {'p': (_849:Person {alias: 'Task Force Honduras'})},\n",
       " {'p': (_850:Person {alias: 'Buhl, Cindy'})},\n",
       " {'p': (_851:Person {alias: 'Gonzalez, Juan S; Reynoso, Julissa; Jacobson, Roberta S'})},\n",
       " {'p': (_852:Person {alias: 'Ohad Cohen'})},\n",
       " {'p': (_853:Person {alias: 'Benton, Cheryl A (Special Use Only); Kennedy, Patrick F; Mills, Cheryl D'})},\n",
       " {'p': (_854:Person {alias: 'McHale, Judith A'})},\n",
       " {'p': (_855:Person {alias: 'Yamamoto, Donald Y; Fitzgerald, William E; Cook, Akunna E; Leonard, Mary Beth'})},\n",
       " {'p': (_856:Person {alias: 'Tesone, Mark'})},\n",
       " {'p': (_857:Person {alias: 'Abedin, Huma; Sullivan, Jacob J; Crowley, Philip J'})},\n",
       " {'p': (_858:Person {alias: 'Fuchs, Michael H; Adler, Caroline E'})},\n",
       " {'p': (_859:Person {alias: 'Sullivan, Jacob J; Crowley, Philip J'})},\n",
       " {'p': (_860:Person {alias: 'Smith, Daniel B; Merten, Kenneth H; Lindwall, David E'})},\n",
       " {'p': (_861:Person {alias: 'Mills, Cheryl D; Ross, Alec J'})},\n",
       " {'p': (_862:Person {alias: 'SES_DutyDeputies; SES-O_SWO-Only; NEA-Staff-Assistants-DL; SES-O_Shift-I'})},\n",
       " {'p': (_863:Person {alias: 'Urban, Carol (Santiago); Simons, Paul E (Santiago)'})},\n",
       " {'p': (_864:Person {alias: 'DiMartino, Kitty; Douglas, Walter T; Mills, Cheryl D; MacInnes, Duncan H; Pally, Maura M; Mellott, Joseph'})},\n",
       " {'p': (_865:Person {alias: 'Waters, John R; LoGerfo, Gregory D; Marchese, Gregory M'})},\n",
       " {'p': (_866:Person {alias: 'Loraine Mangones'})},\n",
       " {'p': (_867:Person {alias: 'Duguid, Gordon K (PACE); Toner, Mark C; Moore, Joanne C (PA/PRS) (PACE); Fleming, John T; Ratney, Michael A'})},\n",
       " {'p': (_868:Person {alias: 'Macmanus, Joseph E; Anne Lyons'})},\n",
       " {'p': (_869:Person {alias: 'Abedin, Huma; Moon, Patrick S; Owen, Michael S; Pershing, Jonathan; Lowe, Matthew D'})},\n",
       " {'p': (_870:Person {alias: 'Crowley, Philip J; Sreebny, Daniel; Pally, Maura M; Douglas, Walter T; DiMartino, Kitty; Kahn, Carol R; Dowd, Katie'})},\n",
       " {'p': (_871:Person {alias: 'Verma, Richard R; Toiv, Nora F'})},\n",
       " {'p': (_872:Person {alias: 'Fuchs, Michael H; Sullivan, Jacob 3'})},\n",
       " {'p': (_873:Person {alias: 'Stanton, Katie; Dowd, Katie W; Ross, Alec 3; Cohen, Jared A'})},\n",
       " {'p': (_874:Person {alias: 'CA Taskforce; TaskForce-1'})},\n",
       " {'p': (_875:Person {alias: 'Kelly, Craig A; Riva-Geoghegan, Margarita M'})},\n",
       " {'p': (_876:Person {alias: 'Leach, Kirk A'})},\n",
       " {'p': (_877:Person {alias: \"'MillsCD@state.gov.\"})},\n",
       " {'p': (_878:Person {alias: 'Meier, Edward F; Seiden, Maya D'})},\n",
       " {'p': (_879:Person {alias: 'Jiloty, Lauren C; cheryl.mills Mills, Cheryl D'})},\n",
       " {'p': (_880:Person {alias: 'Sullivan, Jacob J; MacDonald, Andrew T; Abedin, Hunna; Schlicher, Ronald L; Talwar, Puneet'})},\n",
       " {'p': (_881:Person {alias: 'Jiloty, Lauren C <JilotyLC@state.gov>; cheryl.mills'})},\n",
       " {'p': (_882:Person {alias: 'Sullivan, Jacob J; MacDonald, Andrew T; Abedin, Huma; Schlicher, Ronald L; Talwar, Puneet'})},\n",
       " {'p': (_883:Person {alias: 'Laura Graham; Traci Carpenter'})},\n",
       " {'p': (_884:Person {alias: \"Lakhdhir, Kamala S (Belfast); Roland, Kevin S (Belfast); 'declan.kelly\"})},\n",
       " {'p': (_885:Person {alias: 'Merten, Kenneth H; Sullivan, Jacob 3; Posner, Michael H; Mills, Cheryl D'})},\n",
       " {'p': (_886:Person {alias: 'Merten, Kenneth H; Sullivan, Jacob J; Posner, Michael H; Mills, Cheryl D'})},\n",
       " {'p': (_887:Person {alias: 'Mills, Cheryl D; Mills, Cheryl D'})},\n",
       " {'p': (_888:Person {alias: 'Macmanus, Joseph E'})},\n",
       " {'p': (_889:Person {alias: 'Macmanus, Joseph E <MacmanusJE@state.gov>'})},\n",
       " {'p': (_890:Person {alias: 'Montgomery, Molly C; Baxter, Shawn; Lang, Alan; Waller, Robert P; P-NEA Duty; Waser, Tamir G'})},\n",
       " {'p': (_891:Person {alias: 'H <HDR22@clintonemail.com>'})},\n",
       " {'p': (_892:Person {alias: 'Bitner, Steven R'})},\n",
       " {'p': (_893:Person {alias: 'Bitner, Steven R; NEWS-Mahogany'})},\n",
       " {'p': (_894:Person {alias: \"'sullivanjj@state.gov' <sullivanjj@state.gov>\"})},\n",
       " {'p': (_895:Person {alias: 'Abedin, Huma <AbedinH@state.gov>; Sullivan, Jacob J <Sullivaral@state.gov>'})},\n",
       " {'p': (_896:Person {alias: 'Macnnanus, Joseph E; Burns, William J; West, Thomas; Krol, George A; Hushek, Thomas'})},\n",
       " {'p': (_897:Person {alias: 'Lomellin, Carmen'})},\n",
       " {'p': (_898:Person {alias: 'Merten, Kenneth H; Rodriguez, Karen M; Robinson, Stephanie L'})},\n",
       " {'p': (_899:Person {alias: 'Curtis, Meghann A'})},\n",
       " {'p': (_900:Person {alias: 'Roland, Kevin S (Belfast); McNicholas, Daniel F'})},\n",
       " {'p': (_901:Person {alias: 'Roland, Kevin S (Belfast)'})},\n",
       " {'p': (_902:Person {alias: 'Schlicher, Ronald L; Sanderson, Janet A; Cretz, Gene A; Polaschik, Joan A; Nardi, Margaret H; Kalmbach, Heather E;'})},\n",
       " {'p': (_903:Person {alias: 'Rudman, Mara; Sachar, Alon (NEA/IPA)'})},\n",
       " {'p': (_904:Person {alias: 'Kelly, Craig A; Valenzuela, Arturo A'})},\n",
       " {'p': (_905:Person {alias: 'Goldberg, Philip S; Mull, Stephen D; Sullivan, Jacob J'})},\n",
       " {'p': (_906:Person {alias: 'Rayburn, Dorothy J; Gonzalez, Juan S; Pressfield, Justin C'})},\n",
       " {'p': (_907:Person {alias: 'Schwartz, Larry; Singh, Vikram J; Pauli, Rosemarie; Bommer, Ashley F; Holbrooke, Richard'})},\n",
       " {'p': (_908:Person {alias: 'Campbell, Piper; Hyde, Dana'})},\n",
       " {'p': (_909:Person {alias: 'Ross, ommy eid) <Tommy_Ross@reid.senate.gov>'})},\n",
       " {'p': (_910:Person {alias: 'Sullivan, Jacob J; Mills, Cheryl D'})},\n",
       " {'p': (_911:Person {alias: 'Pauli, Rosemarie'})},\n",
       " {'p': (_912:Person {alias: 'Sullivan, Jacob i; Mills, Cheryl D'})},\n",
       " {'p': (_913:Person {alias: 'SES-O_Shift-II; SES-O_Shift-III'})},\n",
       " {'p': (_914:Person {alias: 'Mills, Cheryl D; Sullivan, Jacobi'})},\n",
       " {'p': (_915:Person {alias: 'Mills, Cheryl D; Sullivan, Jacobi ,'})},\n",
       " {'p': (_916:Person {alias: 'Lew, Jacob J; Steinberg, James B; Mills, Cheryl D; Sullivan, Jacob J'})},\n",
       " {'p': (_917:Person {alias: \"'Poneman, Daniel'; Pyatt, Geoffrey R; Hall, Andrea G;\"})},\n",
       " {'p': (_918:Person {alias: \"'Poneman, Dania; Pyatt, Geoffrey R; Hall, Andrea G; Hoh, Christopher I; Pappas,\"})},\n",
       " {'p': (_919:Person {alias: 'Wells, Alice G; Mull, Stephen D'})},\n",
       " {'p': (_920:Person {alias: 'ChoIlet, Derek H'})},\n",
       " {'p': (_921:Person {alias: 'Chollet, Derek H <CholletDH@state.gov>'})},\n",
       " {'p': (_922:Person {alias: 'ChoIlet, Derek H <CholletDH@state.gov>'})},\n",
       " {'p': (_923:Person {alias: 'NEWS-Mahogany; NEWS-SCA; NEWS-SCT; DS Command Center'})},\n",
       " {'p': (_924:Person {alias: 'Marline Alexis'})},\n",
       " {'p': (_925:Person {alias: 'cheryl.mills _'})},\n",
       " {'p': (_926:Person {alias: 'betsyebeling105C'})},\n",
       " {'p': (_927:Person {alias: 'Macmanus, Joseph E; DiMartino, Kitty; Mills, Cheryl D; Sullivan, Jacob J'})},\n",
       " {'p': (_928:Person {alias: 'Sullivan, Jacob J .'})},\n",
       " {'p': (_929:Person {alias: 'Sullivan, Jacob J; Gonzalez, Juan S'})},\n",
       " {'p': (_930:Person {alias: 'Valenzuela, Arturo A; Verma, Richard R; Johnson, David T; Pascual, Carlos (Mexico City)'})},\n",
       " {'p': (_931:Person {alias: 'Rudman, Mara; Sachar, Alon (NEWIPA)'})},\n",
       " {'p': (_932:Person {alias: 'Lorenz, Andrew R; Martin, Elizabeth K'})},\n",
       " {'p': (_933:Person {alias: 'd.chend'})},\n",
       " {'p': (_934:Person {alias: \"'Gray, Eugene'; Reynoso, Julissa; Kelly, Craig A; Webster, Christopher W; De Pirro, Velia M\"})},\n",
       " {'p': (_935:Person {alias: 'De Pirro, Velia M'})},\n",
       " {'p': (_936:Person {alias: \"'Susan Merten'\"})},\n",
       " {'p': (_937:Person {alias: 'Jake Suliivan'})},\n",
       " {'p': (_938:Person {alias: 'Mills, Cheryl D; Abedin, Huma'})},\n",
       " {'p': (_939:Person {alias: 'Abedin, Huma; Sullivan, Jacob J; Reines, Philippe I; Tauscher, Ellen 0'})},\n",
       " {'p': (_940:Person {alias: 'Sullivan, Jacob J; Abed in, Huma'})},\n",
       " {'p': (_941:Person {alias: 'Sullivan, Jacob J; Abedin, Huma; Toiv, Nora F; Laszczych, Joanne; Smith, Jeannemarie E;'})},\n",
       " {'p': (_942:Person {alias: 'Jake Sullivan'})},\n",
       " {'p': (_943:Person {alias: 'Barton, Rick (USUN); DeMarcellus, Roland F'})},\n",
       " {'p': (_944:Person {alias: \"'Shah, Shivam Ma!lick' <\"})},\n",
       " {'p': (_945:Person {alias: 'Ashraf, Madeeha S; Park, Pamela P; Butte-Dahl, Jennifer X; Beale, Courtney A Kramer; Syed, Zia S'})},\n",
       " {'p': (_946:Person {alias: 'Gonzalez, Juan S'})},\n",
       " {'p': (_947:Person {alias: 'Sullivan, Jacob J; Gatz, Karen L'})},\n",
       " {'p': (_948:Person {alias: \"Sullivan, Jacob.'\"})},\n",
       " {'p': (_949:Person {alias: 'Philbin, Christo her; Kennedy, Patrick F; Verma, Richard R'})},\n",
       " {'p': (_950:Person {alias: 'DiMartino, Kitty; Sullivan, Jacob J; Mills, Cheryl D'})},\n",
       " {'p': (_951:Person {alias: 'Reynoso, Julissa'})},\n",
       " {'p': (_952:Person {alias: 'Stock, Ann; DiMartino, Kitty; Maughan, Chelsea V'})},\n",
       " {'p': (_953:Person {alias: 'Valmoro, Lona J; Abedin, Huma; Stern, Todd D (S/SECC)'})},\n",
       " {'p': (_954:Person {alias: 'Brigety, Reuben; Curtis, Meghann A'})},\n",
       " {'p': (_955:Person {alias: \"Curtis, Meghann A; 'Alexandre, Carl'\"})},\n",
       " {'p': (_956:Person {alias: 'Curtis, Meghann A; Reynoso, Julissa'})},\n",
       " {'p': (_957:Person {alias: 'Slaughter, Anne-Marie; Jones, Paul W'})},\n",
       " {'p': (_958:Person {alias: 'Rodriguez, Miguel E; Feldman, Daniel F; Misko, Sean A'})},\n",
       " {'p': (_959:Person {alias: 'dband'})},\n",
       " {'p': (_960:Person {alias: 'SES-O_Shift-III; SES-O_Shift-I; SES-O_Shift-II'})},\n",
       " {'p': (_961:Person {alias: 'Yamamoto, Donald Y; Baer, Daniel B; Sullivan, Jacob J; Posner, Michael H'})},\n",
       " {'p': (_962:Person {alias: 'Jiloty, Lauren C; Sullivan, Jacob J'})},\n",
       " {'p': (_963:Person {alias: 'Jiloty, Lauren C <JilotyLC@state.gov>; Sullivan, Jacob J <Sullivann@state.gov>'})},\n",
       " {'p': (_964:Person {alias: 'Helfet<'})},\n",
       " {'p': (_965:Person {alias: \"Diane Reynolds; Oscar Flores; 'hanleymr@state.gov'\"})},\n",
       " {'p': (_966:Person {alias: 'Toner, Mark C; Macray, Rosemary R; Echard, John E Jr; Reines, Philippe I'})},\n",
       " {'p': (_967:Person {alias: 'Toner, Mark C; Macray, Rosemary R; Echard, John E Jr; Reines, Philippe I; Sprague, Brenda S; Brennan, John B'})},\n",
       " {'p': (_968:Person {alias: 'Abedin, Huma; Kelly, Craig A; Brownfield, William R; Fuchs, Michael H; Baer, Daniel B; Reines, Philippe I'})},\n",
       " {'p': (_969:Person {alias: 'Mull, Stephen D; Cook, Akunna E; Yamamoto, Donald Y'})},\n",
       " {'p': (_970:Person {alias: 'Crocker, Bathsheba N; Cleveland, Sarah H; Harris, Robert K; Schwartz, Jonathan B'})},\n",
       " {'p': (_971:Person {alias: 'Gordon, Philip H; McEldowney, Nancy E'})},\n",
       " {'p': (_972:Person {alias: 'DiMartino, Kitty; Guimond, Gabrielle; Somerset, Ann D; Douglas, Walter T; Mellott, Joseph; Dickmeyer, James C;'})},\n",
       " {'p': (_973:Person {alias: 'Koh, Harold Hongju; Merten, Kenneth H; Foote, Daniel L'})},\n",
       " {'p': (_974:Person {alias: 'Koh, Harold Hong,ju; Merten, Kenneth H; Foote, Daniel L'})},\n",
       " {'p': (_975:Person {alias: 'Scanlon, Amy B'})},\n",
       " {'p': (_976:Person {alias: \"Abedin, Huma; Stein, Daniel D; O'Brien, Vincent 3; Parris, Mark\"})},\n",
       " {'p': (_977:Person {alias: 'S ES-0_5h ift-II'})},\n",
       " {'p': (_978:Person {alias: \"'Dan Delaney Jr.';\"})},\n",
       " {'p': (_979:Person {alias: 'Shampaine, Nicole D; Tueller, Matthew H'})},\n",
       " {'p': (_980:Person {alias: 'McEldowney, Nancy E; Jones, Stuart; Sommers, Scott E; Slaughter, Anne-Marie'})},\n",
       " {'p': (_981:Person {alias: 'CDM<cheryl.mill'})},\n",
       " {'p': (_982:Person {alias: 'NEWS-SCA; NEWS-Russia; NEWS-Mahogany'})},\n",
       " {'p': (_983:Person {alias: 'Huma Abedin; Jake Sullivan'})},\n",
       " {'p': (_984:Person {alias: \"'hanleymr@state.gov'\"})},\n",
       " {'p': (_985:Person {alias: \"'Cheryl Mills' <\"})},\n",
       " {'p': (_986:Person {alias: 'Sullivan, Jacob.]'})},\n",
       " {'p': (_987:Person {alias: 'Lona Valmoro; HanleyMR@state.gov'})},\n",
       " {'p': (_988:Person {alias: 'Abedin, Huma; Sullivan, Jacob 3'})},\n",
       " {'p': (_989:Person {alias: 'Reines, Philippe I; Valmoro, Lona 1; Abedin, Huma; Schwerin, Daniel B'})},\n",
       " {'p': (_990:Person {alias: 'Holbrooke, Richard;'})},\n",
       " {'p': (_991:Person {alias: 'Burns, William J B5'})},\n",
       " {'p': (_992:Person {alias: 'Echard, John E Jr; Townley, Stephen G; Eichensehr, Kristen E; Cleveland, Sarah H'})},\n",
       " {'p': (_993:Person {alias: 'Kagan, Edgard D; Hyland, Jason P'})},\n",
       " {'p': (_994:Person {alias: 'CDM; Jake Sullivan'})},\n",
       " {'p': (_995:Person {alias: \",'\"})},\n",
       " {'p': (_996:Person {alias: 'Huma Abedin; Lona Valmoro; Jake Sullivan'})},\n",
       " {'p': (_997:Person {alias: 'S_Specia lAssistants'})},\n",
       " {'p': (_998:Person {alias: 'DiMartino, Kitty'})},\n",
       " {'p': (_999:Person {alias: 'Huma Abedin; Lona Valmoro <ValmoroU@state.gov>; Jake Sullivan <'})},\n",
       " {'p': (_1000:Person {alias: 'Yamamoto, Donald Y'})},\n",
       " {'p': (_1001:Person {alias: 'Brudvig, Lee A; Ranneberger, Michael E; Nairobi POL-CORE; Lott, Catie (KENYA/GJD); Kerst, Erna (KENYA/OD);'})},\n",
       " {'p': (_1002:Person {alias: 'Abedin, Huma; Sullivan, Jacob J; Rodriguez, Miguel E'})},\n",
       " {'p': (_1003:Person {alias: 'Schwartz, Eric P; Cook, Nerissa J; Anderson, Gerald C; Le Mon, Christopher J'})},\n",
       " {'p': (_1004:Person {alias: 'Abedin, Huma; S_SpecialAssistants'})},\n",
       " {'p': (_1005:Person {alias: 'Schwartz, Eric P; Cook, Nerissa J; Anderson, Gerald C; Le Mon, Christopher.]'})},\n",
       " {'p': (_1006:Person {alias: 'Hof, Frederic C; Hale, David M; Reed, Julia G'})},\n",
       " {'p': (_1007:Person {alias: 'S_SpecialAssistants <S_SpecialAssistants@state.gov>'})},\n",
       " {'p': (_1008:Person {alias: 'Jake Sullivan; Huma Abed in'})},\n",
       " {'p': (_1009:Person {alias: 'Mills, Cheryl D <MillsCD@state.gov>; Abedin, Huma <AbedinH@state.gov>; Valmoro, Lona 1 <ValmoroU@state.gov>'})},\n",
       " {'p': (_1010:Person {alias: 'Jake Sullivan; megrooney('})},\n",
       " {'p': (_1011:Person {alias: 'lake.sullivan'})},\n",
       " {'p': (_1012:Person {alias: 'Brimmer, Esther D; Pollack, Margaret 3'})},\n",
       " {'p': (_1013:Person {alias: 'DeMarcellus, Roland F; Siemer, Marguerite E'})},\n",
       " {'p': (_1014:Person {alias: 'Huma Abedin <Huma@clintonemail.com>; Jiloty, Lauren C; Russo, Robert V'})},\n",
       " {'p': (_1015:Person {alias: \"'SullivanJJ@state.gov'\"})},\n",
       " {'p': (_1016:Person {alias: 'Kelly, Craig A; Sullivan, Jacob J; Crocker, Bathsheba N; Gonzalez, Juan S'})},\n",
       " {'p': (_1017:Person {alias: 'SSRAP StaffAssistants'})},\n",
       " {'p': (_1018:Person {alias: 'Warnholz, Jean-Louis; Mills, Cheryl D'})},\n",
       " {'p': (_1019:Person {alias: 'Jake Sullivan (State); Cheryl Mills (State)'})},\n",
       " {'p': (_1020:Person {alias: 'Maria McFarland'})},\n",
       " {'p': (_1021:Person {alias: 'Hale, David M; Rudman, Mara; Reed, Julia G'})},\n",
       " {'p': (_1022:Person {alias: 'Hadda, Katherine B; Ensor, David B; Adler, Michael 3; Begley, Valerie'})},\n",
       " {'p': (_1023:Person {alias: 'Lukens, Lewis A; Moy, Kin W; Kidwell, Michael R; Narain, Paul F; Montgomery, Molly C; Kozlowski, Thomas G; Turner,'})},\n",
       " {'p': (_1024:Person {alias: 'Sullivan, Jacob J; Huma Abedin'})},\n",
       " {'p': (_1025:Person {alias: 'Sullivan, Jacobi; Crowley, Philip J'})},\n",
       " {'p': (_1026:Person {alias: 'Graze, Deborah E; Baer, Daniel B; Labowitz, Sarah'})},\n",
       " {'p': (_1027:Person {alias: 'Valenzuela, Arturo A; Reynoso, Julissa'})},\n",
       " {'p': (_1028:Person {alias: 'Huma (Clinton) (Clinton) Abedin'})},\n",
       " {'p': (_1029:Person {alias: 'Sullivan, Jacob J; Carson, Johnnie'})},\n",
       " {'p': (_1030:Person {alias: 'Mary Podesta'})},\n",
       " {'p': (_1031:Person {alias: 'Feltman, Jeffrey D; Wailes, Jacob; S_SpecialAssistants; SES-0; Beecroft, Robert S (Amman)'})},\n",
       " {'p': (_1032:Person {alias: 'Mills, Cheryl D <MillsCD@state.gov>; Sullivan, Jacob J <SullivanJJ@state.gov>; DiMartino, Kitty'})},\n",
       " {'p': (_1033:Person {alias: 'Rudman, Mara'})},\n",
       " {'p': (_1034:Person {alias: 'Feltman, Jeffrey D; Walles, Jacob; S_SpecialAssistants; SES-0; Beecroft, Robert S (Amman)'})},\n",
       " {'p': (_1035:Person {alias: 'SES-O_SWO; SES_DutyDeputies'})},\n",
       " {'p': (_1036:Person {alias: 'SES_DutyDeputies; SES-O_SWO'})},\n",
       " {'p': (_1037:Person {alias: 'Kennedy, Patrick F; Verma, Richard R; Sullivan, Jacob J; Feldman, Daniel F; Singh, Vikram 3; DiMartino, Kitty'})},\n",
       " {'p': (_1038:Person {alias: 'Verma, Richard R; Rooney, Matthew M'})},\n",
       " {'p': (_1039:Person {alias: 'SES-O_Shift-II; SES_DutyDeputies'})},\n",
       " {'p': (_1040:Person {alias: 'Maria Le'})},\n",
       " {'p': (_1041:Person {alias: 'Gonzalez, Juan 5; Kelly, Craig A'})},\n",
       " {'p': (_1042:Person {alias: 'Zil!igen, Joseph H; Mellott, Joseph'})},\n",
       " {'p': (_1043:Person {alias: 'Mull, Stephen D'})},\n",
       " {'p': (_1044:Person {alias: 'Wailes, Jacob; Rudman, Mara; Tsou, Leslie M'})},\n",
       " {'p': (_1045:Person {alias: 'McGovern, Bridget (Helen-Mary)'})},\n",
       " {'p': (_1046:Person {alias: 'Shaker, Joan P'})},\n",
       " {'p': (_1047:Person {alias: 'Fuchs, Michael H; Yamamoto, Donald Y; Cook, Akunna E'})},\n",
       " {'p': (_1048:Person {alias: 'Mills, Cheryl D <MillsCD@state.gov>; Sullivan, Jacob I <Sullivanil@state.gov>'})},\n",
       " {'p': (_1049:Person {alias: 'S_SpecialAsslstants'})},\n",
       " {'p': (_1050:Person {alias: 'Lew, Jacob 1; Sullivan, Jacob J'})},\n",
       " {'p': (_1051:Person {alias: 'Lew, JacobJ'})},\n",
       " {'p': (_1052:Person {alias: 'Lew, Jacob J; Sullivan, Jacob J'})},\n",
       " {'p': (_1053:Person {alias: 'Sullivan, Jacob J; Fuchs, Michael H'})},\n",
       " {'p': (_1054:Person {alias: 'Schwartz, Larry; Bommer, Ashley F; Holbrooke, Richard; Pauli, Rosemarie'})},\n",
       " {'p': (_1055:Person {alias: 'Mills, Cheryl D; Kennedy, Patrick F'})},\n",
       " {'p': (_1056:Person {alias: 'Yamamoto, Donald Y; Sullivan, Jacob ]; Leonard, Mary Beth; Scott, Robert K; Fernandez, Jose W; Paradiso, Dante X'})},\n",
       " {'p': (_1057:Person {alias: 'Davisson, Brandon; Anderson, Roger W'})},\n",
       " {'p': (_1058:Person {alias: 'Muscatine, Lissa; Sullivan, Jacob J; Mills, Cheryl D; Abedin, Huma'})},\n",
       " {'p': (_1059:Person {alias: 'Irwin, Matthew T; Reed, Julia G; Pilz, Amanda C'})},\n",
       " {'p': (_1060:Person {alias: 'Abedin, Huma <AbedinH@state.goy>'})},\n",
       " {'p': (_1061:Person {alias: 'SES-O_SWO'})},\n",
       " {'p': (_1062:Person {alias: 'Muscatine, Lissa; Sullivan, Jacob J; Abedin, Huma'})},\n",
       " {'p': (_1063:Person {alias: 'Muscatine, Lissa; Sullivan, Jacob J'})},\n",
       " {'p': (_1064:Person {alias: 'H <hdr22@clintonemail.com>'})},\n",
       " {'p': (_1065:Person {alias: 'jake.sullivan B6'})},\n",
       " {'p': (_1066:Person {alias: 'Sullivan, Jacob 1; Mills, Cheryl D; Muscatine, Lissa'})},\n",
       " {'p': (_1067:Person {alias: 'Sullivan, Jacobi <Sullivanil@state.gov>; Mills, Cheryl D <MillsCD@state.gov>; Abedin, Huma <AbedinH@state.gov>;'})},\n",
       " {'p': (_1068:Person {alias: 'SES-O_OS'})},\n",
       " {'p': (_1069:Person {alias: 'Ruggiero, Frank J; Feldman, Daniel F; McHale, Judith A; Singh, Vikram J; Sullivan, Jacob J; Shah, Rajiv (AID/A);'})},\n",
       " {'p': (_1070:Person {alias: 'Sullivan, Jacob 3; Reines, Philippe I'})},\n",
       " {'p': (_1071:Person {alias: 'reinesp@state.gov; sullivanjj@state.gov'})},\n",
       " {'p': (_1072:Person {alias: 'reinesp@state.gov <reinesp@state.gov>; sullivanjj@state.gov <sullivanjj@state.gov>'})},\n",
       " {'p': (_1073:Person {alias: \"Jiloty, Lauren C; 'Laurenjilot\"})},\n",
       " {'p': (_1074:Person {alias: '5ES-0_05'})},\n",
       " {'p': (_1075:Person {alias: 'MacInnes, Duncan H; Bosshardt, Marcia P; Klevorick, Caitlin B; Kenna, Corley; Smith, Dana S; Hensman, Chris D'})},\n",
       " {'p': (_1076:Person {alias: 'SES-O_Shift-I; SES-O_Shift-I1'})},\n",
       " {'p': (_1077:Person {alias: 'Mills, Cheryl D; Steinberg, James B; Sullivan, Jacob J; Abedin, Huma'})},\n",
       " {'p': (_1078:Person {alias: 'Korycki, Leonard 3; ECA_PE_C_PY'})},\n",
       " {'p': (_1079:Person {alias: 'Sullivan, Jacob J; Abedin, Huma; Mills, Cheryl D'})},\n",
       " {'p': (_1080:Person {alias: 'Sullivan, Jacob .1; Abedin, Huma; Mills, Cheryl D'})},\n",
       " {'p': (_1081:Person {alias: 'Mills, Cheryl D; lake.sullivar b Huma Abedin <Huma@clintonemail.com>'})},\n",
       " {'p': (_1082:Person {alias: 'Sullivan, Jacob.); Abedin, Huma; Mills, Cheryl D'})},\n",
       " {'p': (_1083:Person {alias: 'Abedin, Huma; Sullivan, Jacob J; Muscatine, Lissa; Mills, Cheryl D'})},\n",
       " {'p': (_1084:Person {alias: 'NEWS-Mahogany; NEWS-Iran; NEWS-CA; SES-O_SWO; PA FO Group'})},\n",
       " {'p': (_1085:Person {alias: 'Shampaine, Nicole D; Jacobs, Janice L; Kennedy, Patrick F; Jacobs, Susan S; Tueller, Matthew H'})},\n",
       " {'p': (_1086:Person {alias: 'SES-0_0S; SES-O_Shift-I'})},\n",
       " {'p': (_1087:Person {alias: 'Feeley, John D (Mexico City); Restrepo Dan'})},\n",
       " {'p': (_1088:Person {alias: 'Abedin, Huma; Sullivan, Jacob J; Mills, Cheryl D'})},\n",
       " {'p': (_1089:Person {alias: 'SES-0_0S; SES-O_Shift-II'})},\n",
       " {'p': (_1090:Person {alias: 'SES-0_05; SES-O_CMS; SES-O_Shift-II'})},\n",
       " {'p': (_1091:Person {alias: 'SES-O_Shift-II; SES-0_05'})},\n",
       " {'p': (_1092:Person {alias: 'Reines, Philippe I; Sullivan, Jacob 1'})},\n",
       " {'p': (_1093:Person {alias: 'SES-0_05; SES-O_Shift-III'})},\n",
       " {'p': (_1094:Person {alias: 'SES-O_Shift-II; SES-O_OS'})},\n",
       " {'p': (_1095:Person {alias: 'Blake, Robert 0'})},\n",
       " {'p': (_1096:Person {alias: 'Burns, William'})},\n",
       " {'p': (_1097:Person {alias: 'Wells, Alice G; Sullivan, Jacob J'})},\n",
       " {'p': (_1098:Person {alias: 'Sanchez, Mauricio X; Ortiz, Katherine I; Dressel, Abigail L.; Mattern, Daniel S; Martin, Elizabeth K; Pease, Leah M;'})},\n",
       " {'p': (_1099:Person {alias: 'SES-O_Shift-I; SES-O_Shift-II; SES-O_OS'})},\n",
       " {'p': (_1100:Person {alias: 'SES-0_0S; SES-O_Shift-11'})},\n",
       " {'p': (_1101:Person {alias: 'SES-0_0S; SES-O_Shlft-II'})},\n",
       " {'p': (_1102:Person {alias: 'SES-0_0S; SES-O_Shift-II; SES-O_Shift-III'})},\n",
       " {'p': (_1103:Person {alias: 'Sullivan, Jacob 1 <Sullivan11@state.gov>; Mills, Cheryl D <MillsCD@state.gov>'})},\n",
       " {'p': (_1104:Person {alias: 'Gonzalez, Juan S <GonzalezJS\\u00ac\\u00a9state.gov>:'})},\n",
       " {'p': (_1105:Person {alias: 'Laurenjilot'})},\n",
       " {'p': (_1106:Person {alias: 'SES-O_Shift-II; SES-0_0S; SES-O_CMS'})},\n",
       " {'p': (_1107:Person {alias: 'Davisson, Brandon; Anderson, Roger W; Bordley, Donna; Klevorick, Caitlin B; Shah, Khushali P; Thessin, James H'})},\n",
       " {'p': (_1108:Person {alias: 'CEA'})},\n",
       " {'p': (_1109:Person {alias: 'CEA <AdlerCE@state.gov>'})},\n",
       " {'p': (_1110:Person {alias: 'SES-0_0S; SES-O_Shift-HI'})},\n",
       " {'p': (_1111:Person {alias: 'SES-0_05'})},\n",
       " {'p': (_1112:Person {alias: 'lake.sullivan >'})},\n",
       " {'p': (_1113:Person {alias: 'Powers, Roberto; Tueller, Matthew Fl'})},\n",
       " {'p': (_1114:Person {alias: 'SES-O_Shift-I; SES-O_OS'})},\n",
       " {'p': (_1115:Person {alias: 'Sullivan, Jacob 1; Mills, Cheryl D; Abedin, Huma'})},\n",
       " {'p': (_1116:Person {alias: 'Sullivan, Jacob J; Mills, Cheryl D; Abedin, Huma'})},\n",
       " {'p': (_1117:Person {alias: 'NEWS-Iran; NEWS-Mahogany'})},\n",
       " {'p': (_1118:Person {alias: 'SES-O_Shlft-III; NEWS-Iran'})},\n",
       " {'p': (_1119:Person {alias: 'Patel, Nirav S'})},\n",
       " {'p': (_1120:Person {alias: 'Masonis, Melinda J; Harris, Jennifer D; Smith, Dana S'})},\n",
       " {'p': (_1121:Person {alias: 'SES-0_0S; NEWS-Mahogany'})},\n",
       " {'p': (_1122:Person {alias: 'Sullivan, Jacob 3; Reines, Philippe I; Mills, Cheryl D'})},\n",
       " {'p': (_1123:Person {alias: 'Sullivan, Jacob J; Muscatine, Lissa; Mills, Cheryl D'})},\n",
       " {'p': (_1124:Person {alias: 'SES-0_0S; SES-O_CMS; SES-O_Shift-III'})},\n",
       " {'p': (_1125:Person {alias: 'SES-O_Shift-II; SES-O_Shift-111; SES-O_SWO'})},\n",
       " {'p': (_1126:Person {alias: 'Crosby, Colin T'})},\n",
       " {'p': (_1127:Person {alias: '5ES-0_5111ft-III'})},\n",
       " {'p': (_1128:Person {alias: 'Feeley, John D (Mexico City);'})},\n",
       " {'p': (_1129:Person {alias: 'Huma Abedin <Huma@clintonemail.com>'})},\n",
       " {'p': (_1130:Person {alias: 'SES-O_OS; SES-O_Shift-II'})},\n",
       " {'p': (_1131:Person {alias: 'SES-O_Shift-III; SES-0_05'})},\n",
       " {'p': (_1132:Person {alias: 'SES-0_0S; SES-O_Shift-Ill'})},\n",
       " {'p': (_1133:Person {alias: 'Blakeman, Chat (01G); WikiLeaks WG; SES_4'})},\n",
       " ...]"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "## 4) Who's been naughty and has not directly emailed {alias: \"Clinton, Hillary\"}?\n",
    "query = \"MATCH (p), (n:Person {alias: 'Clinton, Hillary'}) WHERE NOT (p)-[:SENT_EMAIL_TO]->(n) RETURN p\"\n",
    "graph.run(query).data()\n",
    "\n",
    "## 1196 rows affected.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
